GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
// Register: DMA1CON0
#define DMA1CON0 DMA1CON0
extern volatile unsigned char           DMA1CON0            __at(0x3BFC);
#ifndef _LIB_BUILD
asm("DMA1CON0 equ 03BFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XIP                    :1;
        unsigned                        :1;
        unsigned AIRQEN                 :1;
        unsigned                        :2;
        unsigned DGO                    :1;
        unsigned SIRQEN                 :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned DMA1XIP                :1;
        unsigned                        :1;
        unsigned DMA1AIRQEN             :1;
        unsigned                        :2;
        unsigned DMA1DGO                :1;
        unsigned DMA1SIRQEN             :1;
        unsigned DMA1EN                 :1;
    };
} DMA1CON0bits_t;
extern volatile DMA1CON0bits_t DMA1CON0bits __at(0x3BFC);
// bitfield macros
#define _DMA1CON0_XIP_POSN                                  0x0
#define _DMA1CON0_XIP_POSITION                              0x0
#define _DMA1CON0_XIP_SIZE                                  0x1
#define _DMA1CON0_XIP_LENGTH                                0x1
#define _DMA1CON0_XIP_MASK                                  0x1
#define _DMA1CON0_AIRQEN_POSN                               0x2
#define _DMA1CON0_AIRQEN_POSITION                           0x2
#define _DMA1CON0_AIRQEN_SIZE                               0x1
#define _DMA1CON0_AIRQEN_LENGTH                             0x1
#define _DMA1CON0_AIRQEN_MASK                               0x4
#define _DMA1CON0_DGO_POSN                                  0x5
#define _DMA1CON0_DGO_POSITION                              0x5
#define _DMA1CON0_DGO_SIZE                                  0x1
#define _DMA1CON0_DGO_LENGTH                                0x1
#define _DMA1CON0_DGO_MASK                                  0x20
#define _DMA1CON0_SIRQEN_POSN                               0x6
#define _DMA1CON0_SIRQEN_POSITION                           0x6
#define _DMA1CON0_SIRQEN_SIZE                               0x1
#define _DMA1CON0_SIRQEN_LENGTH                             0x1
#define _DMA1CON0_SIRQEN_MASK                               0x40
#define _DMA1CON0_EN_POSN                                   0x7
#define _DMA1CON0_EN_POSITION                               0x7
#define _DMA1CON0_EN_SIZE                                   0x1
#define _DMA1CON0_EN_LENGTH                                 0x1
#define _DMA1CON0_EN_MASK                                   0x80
#define _DMA1CON0_DMA1XIP_POSN                              0x0
#define _DMA1CON0_DMA1XIP_POSITION                          0x0
#define _DMA1CON0_DMA1XIP_SIZE                              0x1
#define _DMA1CON0_DMA1XIP_LENGTH                            0x1
#define _DMA1CON0_DMA1XIP_MASK                              0x1
#define _DMA1CON0_DMA1AIRQEN_POSN                           0x2
#define _DMA1CON0_DMA1AIRQEN_POSITION                       0x2
#define _DMA1CON0_DMA1AIRQEN_SIZE                           0x1
#define _DMA1CON0_DMA1AIRQEN_LENGTH                         0x1
#define _DMA1CON0_DMA1AIRQEN_MASK                           0x4
#define _DMA1CON0_DMA1DGO_POSN                              0x5
#define _DMA1CON0_DMA1DGO_POSITION                          0x5
#define _DMA1CON0_DMA1DGO_SIZE                              0x1
#define _DMA1CON0_DMA1DGO_LENGTH                            0x1
#define _DMA1CON0_DMA1DGO_MASK                              0x20
#define _DMA1CON0_DMA1SIRQEN_POSN                           0x6
#define _DMA1CON0_DMA1SIRQEN_POSITION                       0x6
#define _DMA1CON0_DMA1SIRQEN_SIZE                           0x1
#define _DMA1CON0_DMA1SIRQEN_LENGTH                         0x1
#define _DMA1CON0_DMA1SIRQEN_MASK                           0x40
#define _DMA1CON0_DMA1EN_POSN                               0x7
#define _DMA1CON0_DMA1EN_POSITION                           0x7
#define _DMA1CON0_DMA1EN_SIZE                               0x1
#define _DMA1CON0_DMA1EN_LENGTH                             0x1
#define _DMA1CON0_DMA1EN_MASK                               0x80

// Register: DMA1CON1
#define DMA1CON1 DMA1CON1
extern volatile unsigned char           DMA1CON1            __at(0x3BFD);
#ifndef _LIB_BUILD
asm("DMA1CON1 equ 03BFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMA1CON1bits_t;
extern volatile DMA1CON1bits_t DMA1CON1bits __at(0x3BFD);
// bitfield macros
#define _DMA1CON1_SSTP_POSN                                 0x0
#define _DMA1CON1_SSTP_POSITION                             0x0
#define _DMA1CON1_SSTP_SIZE                                 0x1
#define _DMA1CON1_SSTP_LENGTH                               0x1
#define _DMA1CON1_SSTP_MASK                                 0x1
#define _DMA1CON1_SMODE_POSN                                0x1
#define _DMA1CON1_SMODE_POSITION                            0x1
#define _DMA1CON1_SMODE_SIZE                                0x2
#define _DMA1CON1_SMODE_LENGTH                              0x2
#define _DMA1CON1_SMODE_MASK                                0x6
#define _DMA1CON1_SMR_POSN                                  0x3
#define _DMA1CON1_SMR_POSITION                              0x3
#define _DMA1CON1_SMR_SIZE                                  0x2
#define _DMA1CON1_SMR_LENGTH                                0x2
#define _DMA1CON1_SMR_MASK                                  0x18
#define _DMA1CON1_DSTP_POSN                                 0x5
#define _DMA1CON1_DSTP_POSITION                             0x5
#define _DMA1CON1_DSTP_SIZE                                 0x1
#define _DMA1CON1_DSTP_LENGTH                               0x1
#define _DMA1CON1_DSTP_MASK                                 0x20
#define _DMA1CON1_DMODE_POSN                                0x6
#define _DMA1CON1_DMODE_POSITION                            0x6
#define _DMA1CON1_DMODE_SIZE                                0x2
#define _DMA1CON1_DMODE_LENGTH                              0x2
#define _DMA1CON1_DMODE_MASK                                0xC0

// Register: DMA1AIRQ
#define DMA1AIRQ DMA1AIRQ
extern volatile unsigned char           DMA1AIRQ            __at(0x3BFE);
#ifndef _LIB_BUILD
asm("DMA1AIRQ equ 03BFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned DMA1AIRQ               :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
    };
    struct {
        unsigned DMA1AIRQ0              :1;
        unsigned DMA1AIRQ1              :1;
        unsigned DMA1AIRQ2              :1;
        unsigned DMA1AIRQ3              :1;
        unsigned DMA1AIRQ4              :1;
        unsigned DMA1AIRQ5              :1;
        unsigned DMA1AIRQ6              :1;
    };
} DMA1AIRQbits_t;
