GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
extern volatile SPI1CON2bits_t SPI1CON2bits __at(0x3D16);
// bitfield macros
#define _SPI1CON2_RXR_POSN                                  0x0
#define _SPI1CON2_RXR_POSITION                              0x0
#define _SPI1CON2_RXR_SIZE                                  0x1
#define _SPI1CON2_RXR_LENGTH                                0x1
#define _SPI1CON2_RXR_MASK                                  0x1
#define _SPI1CON2_TXR_POSN                                  0x1
#define _SPI1CON2_TXR_POSITION                              0x1
#define _SPI1CON2_TXR_SIZE                                  0x1
#define _SPI1CON2_TXR_LENGTH                                0x1
#define _SPI1CON2_TXR_MASK                                  0x2
#define _SPI1CON2_SSET_POSN                                 0x2
#define _SPI1CON2_SSET_POSITION                             0x2
#define _SPI1CON2_SSET_SIZE                                 0x1
#define _SPI1CON2_SSET_LENGTH                               0x1
#define _SPI1CON2_SSET_MASK                                 0x4
#define _SPI1CON2_SSFLT_POSN                                0x6
#define _SPI1CON2_SSFLT_POSITION                            0x6
#define _SPI1CON2_SSFLT_SIZE                                0x1
#define _SPI1CON2_SSFLT_LENGTH                              0x1
#define _SPI1CON2_SSFLT_MASK                                0x40
#define _SPI1CON2_BUSY_POSN                                 0x7
#define _SPI1CON2_BUSY_POSITION                             0x7
#define _SPI1CON2_BUSY_SIZE                                 0x1
#define _SPI1CON2_BUSY_LENGTH                               0x1
#define _SPI1CON2_BUSY_MASK                                 0x80
#define _SPI1CON2_SPI1RXR_POSN                              0x0
#define _SPI1CON2_SPI1RXR_POSITION                          0x0
#define _SPI1CON2_SPI1RXR_SIZE                              0x1
#define _SPI1CON2_SPI1RXR_LENGTH                            0x1
#define _SPI1CON2_SPI1RXR_MASK                              0x1
#define _SPI1CON2_SPI1TXR_POSN                              0x1
#define _SPI1CON2_SPI1TXR_POSITION                          0x1
#define _SPI1CON2_SPI1TXR_SIZE                              0x1
#define _SPI1CON2_SPI1TXR_LENGTH                            0x1
#define _SPI1CON2_SPI1TXR_MASK                              0x2
#define _SPI1CON2_SPI1SSET_POSN                             0x2
#define _SPI1CON2_SPI1SSET_POSITION                         0x2
#define _SPI1CON2_SPI1SSET_SIZE                             0x1
#define _SPI1CON2_SPI1SSET_LENGTH                           0x1
#define _SPI1CON2_SPI1SSET_MASK                             0x4
#define _SPI1CON2_SPI1SSFLT_POSN                            0x6
#define _SPI1CON2_SPI1SSFLT_POSITION                        0x6
#define _SPI1CON2_SPI1SSFLT_SIZE                            0x1
#define _SPI1CON2_SPI1SSFLT_LENGTH                          0x1
#define _SPI1CON2_SPI1SSFLT_MASK                            0x40
#define _SPI1CON2_SPI1BUSY_POSN                             0x7
#define _SPI1CON2_SPI1BUSY_POSITION                         0x7
#define _SPI1CON2_SPI1BUSY_SIZE                             0x1
#define _SPI1CON2_SPI1BUSY_LENGTH                           0x1
#define _SPI1CON2_SPI1BUSY_MASK                             0x80

// Register: SPI1STATUS
#define SPI1STATUS SPI1STATUS
extern volatile unsigned char           SPI1STATUS          __at(0x3D17);
#ifndef _LIB_BUILD
asm("SPI1STATUS equ 03D17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
    struct {
        unsigned SPI1RXBF               :1;
        unsigned                        :1;
        unsigned SPI1CLRBF              :1;
        unsigned SPI1RXRE               :1;
        unsigned                        :1;
        unsigned SPI1TXBE               :1;
        unsigned                        :1;
        unsigned SPI1TXWE               :1;
    };
} SPI1STATUSbits_t;
extern volatile SPI1STATUSbits_t SPI1STATUSbits __at(0x3D17);
// bitfield macros
#define _SPI1STATUS_RXBF_POSN                               0x0
#define _SPI1STATUS_RXBF_POSITION                           0x0
#define _SPI1STATUS_RXBF_SIZE                               0x1
#define _SPI1STATUS_RXBF_LENGTH                             0x1
#define _SPI1STATUS_RXBF_MASK                               0x1
#define _SPI1STATUS_CLRBF_POSN                              0x2
#define _SPI1STATUS_CLRBF_POSITION                          0x2
#define _SPI1STATUS_CLRBF_SIZE                              0x1
#define _SPI1STATUS_CLRBF_LENGTH                            0x1
#define _SPI1STATUS_CLRBF_MASK                              0x4
#define _SPI1STATUS_RXRE_POSN                               0x3
#define _SPI1STATUS_RXRE_POSITION                           0x3
#define _SPI1STATUS_RXRE_SIZE                               0x1
#define _SPI1STATUS_RXRE_LENGTH                             0x1
#define _SPI1STATUS_RXRE_MASK                               0x8
#define _SPI1STATUS_TXBE_POSN                               0x5
#define _SPI1STATUS_TXBE_POSITION                           0x5
#define _SPI1STATUS_TXBE_SIZE                               0x1
#define _SPI1STATUS_TXBE_LENGTH                             0x1
#define _SPI1STATUS_TXBE_MASK                               0x20
#define _SPI1STATUS_TXWE_POSN                               0x7
#define _SPI1STATUS_TXWE_POSITION                           0x7
#define _SPI1STATUS_TXWE_SIZE                               0x1
#define _SPI1STATUS_TXWE_LENGTH                             0x1
#define _SPI1STATUS_TXWE_MASK                               0x80
#define _SPI1STATUS_SPI1RXBF_POSN                           0x0
#define _SPI1STATUS_SPI1RXBF_POSITION                       0x0
#define _SPI1STATUS_SPI1RXBF_SIZE                           0x1
#define _SPI1STATUS_SPI1RXBF_LENGTH                         0x1
#define _SPI1STATUS_SPI1RXBF_MASK                           0x1
#define _SPI1STATUS_SPI1CLRBF_POSN                          0x2
#define _SPI1STATUS_SPI1CLRBF_POSITION                      0x2
#define _SPI1STATUS_SPI1CLRBF_SIZE                          0x1
#define _SPI1STATUS_SPI1CLRBF_LENGTH                        0x1
#define _SPI1STATUS_SPI1CLRBF_MASK                          0x4
#define _SPI1STATUS_SPI1RXRE_POSN                           0x3
#define _SPI1STATUS_SPI1RXRE_POSITION                       0x3
#define _SPI1STATUS_SPI1RXRE_SIZE                           0x1
#define _SPI1STATUS_SPI1RXRE_LENGTH                         0x1
#define _SPI1STATUS_SPI1RXRE_MASK                           0x8
#define _SPI1STATUS_SPI1TXBE_POSN                           0x5
#define _SPI1STATUS_SPI1TXBE_POSITION                       0x5
#define _SPI1STATUS_SPI1TXBE_SIZE                           0x1
#define _SPI1STATUS_SPI1TXBE_LENGTH                         0x1
#define _SPI1STATUS_SPI1TXBE_MASK                           0x20
#define _SPI1STATUS_SPI1TXWE_POSN                           0x7
#define _SPI1STATUS_SPI1TXWE_POSITION                       0x7
#define _SPI1STATUS_SPI1TXWE_SIZE                           0x1
#define _SPI1STATUS_SPI1TXWE_LENGTH                         0x1
#define _SPI1STATUS_SPI1TXWE_MASK                           0x80

// Register: SPI1TWIDTH
#define SPI1TWIDTH SPI1TWIDTH
extern volatile unsigned char           SPI1TWIDTH          __at(0x3D18);
#ifndef _LIB_BUILD
asm("SPI1TWIDTH equ 03D18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TWIDTH                 :3;
    };
    struct {
        unsigned TWIDTH0                :1;
        unsigned TWIDTH1                :1;
        unsigned TWIDTH2                :1;
    };
} SPI1TWIDTHbits_t;
extern volatile SPI1TWIDTHbits_t SPI1TWIDTHbits __at(0x3D18);
// bitfield macros
#define _SPI1TWIDTH_TWIDTH_POSN                             0x0
#define _SPI1TWIDTH_TWIDTH_POSITION                         0x0
#define _SPI1TWIDTH_TWIDTH_SIZE                             0x3
#define _SPI1TWIDTH_TWIDTH_LENGTH                           0x3
#define _SPI1TWIDTH_TWIDTH_MASK                             0x7
#define _SPI1TWIDTH_TWIDTH0_POSN                            0x0
#define _SPI1TWIDTH_TWIDTH0_POSITION                        0x0
#define _SPI1TWIDTH_TWIDTH0_SIZE                            0x1
#define _SPI1TWIDTH_TWIDTH0_LENGTH                          0x1
#define _SPI1TWIDTH_TWIDTH0_MASK                            0x1
#define _SPI1TWIDTH_TWIDTH1_POSN                            0x1
#define _SPI1TWIDTH_TWIDTH1_POSITION                        0x1
#define _SPI1TWIDTH_TWIDTH1_SIZE                            0x1
#define _SPI1TWIDTH_TWIDTH1_LENGTH                          0x1
#define _SPI1TWIDTH_TWIDTH1_MASK                            0x2
#define _SPI1TWIDTH_TWIDTH2_POSN                            0x2
#define _SPI1TWIDTH_TWIDTH2_POSITION                        0x2
#define _SPI1TWIDTH_TWIDTH2_SIZE                            0x1
#define _SPI1TWIDTH_TWIDTH2_LENGTH                          0x1
#define _SPI1TWIDTH_TWIDTH2_MASK                            0x4

// Register: SPI1BAUD
#define SPI1BAUD SPI1BAUD
extern volatile unsigned char           SPI1BAUD            __at(0x3D19);
#ifndef _LIB_BUILD
asm("SPI1BAUD equ 03D19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
    struct {
        unsigned BAUD0                  :1;
        unsigned BAUD1                  :1;
        unsigned BAUD2                  :1;
        unsigned BAUD3                  :1;
        unsigned BAUD4                  :1;
        unsigned BAUD5                  :1;
        unsigned BAUD6                  :1;
        unsigned BAUD7                  :1;
    };
} SPI1BAUDbits_t;
extern volatile SPI1BAUDbits_t SPI1BAUDbits __at(0x3D19);
// bitfield macros
#define _SPI1BAUD_BAUD_POSN                                 0x0
#define _SPI1BAUD_BAUD_POSITION                             0x0
#define _SPI1BAUD_BAUD_SIZE                                 0x8
#define _SPI1BAUD_BAUD_LENGTH                               0x8
#define _SPI1BAUD_BAUD_MASK                                 0xFF
#define _SPI1BAUD_BAUD0_POSN                                0x0
#define _SPI1BAUD_BAUD0_POSITION                            0x0
#define _SPI1BAUD_BAUD0_SIZE                                0x1
#define _SPI1BAUD_BAUD0_LENGTH                              0x1
#define _SPI1BAUD_BAUD0_MASK                                0x1
#define _SPI1BAUD_BAUD1_POSN                                0x1
#define _SPI1BAUD_BAUD1_POSITION                            0x1
#define _SPI1BAUD_BAUD1_SIZE                                0x1
#define _SPI1BAUD_BAUD1_LENGTH                              0x1
#define _SPI1BAUD_BAUD1_MASK                                0x2
#define _SPI1BAUD_BAUD2_POSN                                0x2
#define _SPI1BAUD_BAUD2_POSITION                            0x2
#define _SPI1BAUD_BAUD2_SIZE                                0x1
#define _SPI1BAUD_BAUD2_LENGTH                              0x1
#define _SPI1BAUD_BAUD2_MASK                                0x4
#define _SPI1BAUD_BAUD3_POSN                                0x3
#define _SPI1BAUD_BAUD3_POSITION                            0x3
#define _SPI1BAUD_BAUD3_SIZE                                0x1
#define _SPI1BAUD_BAUD3_LENGTH                              0x1
#define _SPI1BAUD_BAUD3_MASK                                0x8
#define _SPI1BAUD_BAUD4_POSN                                0x4
#define _SPI1BAUD_BAUD4_POSITION                            0x4
#define _SPI1BAUD_BAUD4_SIZE                                0x1
#define _SPI1BAUD_BAUD4_LENGTH                              0x1
#define _SPI1BAUD_BAUD4_MASK                                0x10
#define _SPI1BAUD_BAUD5_POSN                                0x5
#define _SPI1BAUD_BAUD5_POSITION                            0x5
#define _SPI1BAUD_BAUD5_SIZE                                0x1
#define _SPI1BAUD_BAUD5_LENGTH                              0x1
#define _SPI1BAUD_BAUD5_MASK                                0x20
#define _SPI1BAUD_BAUD6_POSN                                0x6
#define _SPI1BAUD_BAUD6_POSITION                            0x6
#define _SPI1BAUD_BAUD6_SIZE                                0x1
#define _SPI1BAUD_BAUD6_LENGTH                              0x1
#define _SPI1BAUD_BAUD6_MASK                                0x40
#define _SPI1BAUD_BAUD7_POSN                                0x7
#define _SPI1BAUD_BAUD7_POSITION                            0x7
#define _SPI1BAUD_BAUD7_SIZE                                0x1
#define _SPI1BAUD_BAUD7_LENGTH                              0x1
#define _SPI1BAUD_BAUD7_MASK                                0x80

