GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
// Register: NCO1CLK
#define NCO1CLK NCO1CLK
extern volatile unsigned char           NCO1CLK             __at(0x3F3F);
#ifndef _LIB_BUILD
asm("NCO1CLK equ 03F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKS                    :4;
        unsigned                        :1;
        unsigned PWS                    :3;
    };
    struct {
        unsigned CKS0                   :1;
        unsigned CKS1                   :1;
        unsigned CKS2                   :1;
        unsigned CKS3                   :1;
        unsigned                        :1;
        unsigned PWS0                   :1;
        unsigned PWS1                   :1;
        unsigned PWS2                   :1;
    };
    struct {
        unsigned NCO1CKS                :4;
        unsigned                        :1;
        unsigned NCO1PWS                :3;
    };
    struct {
        unsigned NCO1CKS0               :1;
        unsigned NCO1CKS1               :1;
        unsigned NCO1CKS2               :1;
        unsigned NCO1CKS3               :1;
        unsigned                        :1;
        unsigned NCO1PWS0               :1;
        unsigned NCO1PWS1               :1;
        unsigned NCO1PWS2               :1;
    };
} NCO1CLKbits_t;
extern volatile NCO1CLKbits_t NCO1CLKbits __at(0x3F3F);
// bitfield macros
#define _NCO1CLK_CKS_POSN                                   0x0
#define _NCO1CLK_CKS_POSITION                               0x0
#define _NCO1CLK_CKS_SIZE                                   0x4
#define _NCO1CLK_CKS_LENGTH                                 0x4
#define _NCO1CLK_CKS_MASK                                   0xF
#define _NCO1CLK_PWS_POSN                                   0x5
#define _NCO1CLK_PWS_POSITION                               0x5
#define _NCO1CLK_PWS_SIZE                                   0x3
#define _NCO1CLK_PWS_LENGTH                                 0x3
#define _NCO1CLK_PWS_MASK                                   0xE0
#define _NCO1CLK_CKS0_POSN                                  0x0
#define _NCO1CLK_CKS0_POSITION                              0x0
#define _NCO1CLK_CKS0_SIZE                                  0x1
#define _NCO1CLK_CKS0_LENGTH                                0x1
#define _NCO1CLK_CKS0_MASK                                  0x1
#define _NCO1CLK_CKS1_POSN                                  0x1
#define _NCO1CLK_CKS1_POSITION                              0x1
#define _NCO1CLK_CKS1_SIZE                                  0x1
#define _NCO1CLK_CKS1_LENGTH                                0x1
#define _NCO1CLK_CKS1_MASK                                  0x2
#define _NCO1CLK_CKS2_POSN                                  0x2
#define _NCO1CLK_CKS2_POSITION                              0x2
#define _NCO1CLK_CKS2_SIZE                                  0x1
#define _NCO1CLK_CKS2_LENGTH                                0x1
#define _NCO1CLK_CKS2_MASK                                  0x4
#define _NCO1CLK_CKS3_POSN                                  0x3
#define _NCO1CLK_CKS3_POSITION                              0x3
#define _NCO1CLK_CKS3_SIZE                                  0x1
#define _NCO1CLK_CKS3_LENGTH                                0x1
#define _NCO1CLK_CKS3_MASK                                  0x8
#define _NCO1CLK_PWS0_POSN                                  0x5
#define _NCO1CLK_PWS0_POSITION                              0x5
#define _NCO1CLK_PWS0_SIZE                                  0x1
#define _NCO1CLK_PWS0_LENGTH                                0x1
#define _NCO1CLK_PWS0_MASK                                  0x20
#define _NCO1CLK_PWS1_POSN                                  0x6
#define _NCO1CLK_PWS1_POSITION                              0x6
#define _NCO1CLK_PWS1_SIZE                                  0x1
#define _NCO1CLK_PWS1_LENGTH                                0x1
#define _NCO1CLK_PWS1_MASK                                  0x40
#define _NCO1CLK_PWS2_POSN                                  0x7
#define _NCO1CLK_PWS2_POSITION                              0x7
#define _NCO1CLK_PWS2_SIZE                                  0x1
#define _NCO1CLK_PWS2_LENGTH                                0x1
#define _NCO1CLK_PWS2_MASK                                  0x80
#define _NCO1CLK_NCO1CKS_POSN                               0x0
#define _NCO1CLK_NCO1CKS_POSITION                           0x0
#define _NCO1CLK_NCO1CKS_SIZE                               0x4
#define _NCO1CLK_NCO1CKS_LENGTH                             0x4
#define _NCO1CLK_NCO1CKS_MASK                               0xF
#define _NCO1CLK_NCO1PWS_POSN                               0x5
#define _NCO1CLK_NCO1PWS_POSITION                           0x5
#define _NCO1CLK_NCO1PWS_SIZE                               0x3
#define _NCO1CLK_NCO1PWS_LENGTH                             0x3
#define _NCO1CLK_NCO1PWS_MASK                               0xE0
#define _NCO1CLK_NCO1CKS0_POSN                              0x0
#define _NCO1CLK_NCO1CKS0_POSITION                          0x0
#define _NCO1CLK_NCO1CKS0_SIZE                              0x1
#define _NCO1CLK_NCO1CKS0_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS0_MASK                              0x1
#define _NCO1CLK_NCO1CKS1_POSN                              0x1
#define _NCO1CLK_NCO1CKS1_POSITION                          0x1
#define _NCO1CLK_NCO1CKS1_SIZE                              0x1
#define _NCO1CLK_NCO1CKS1_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS1_MASK                              0x2
#define _NCO1CLK_NCO1CKS2_POSN                              0x2
#define _NCO1CLK_NCO1CKS2_POSITION                          0x2
#define _NCO1CLK_NCO1CKS2_SIZE                              0x1
#define _NCO1CLK_NCO1CKS2_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS2_MASK                              0x4
#define _NCO1CLK_NCO1CKS3_POSN                              0x3
#define _NCO1CLK_NCO1CKS3_POSITION                          0x3
#define _NCO1CLK_NCO1CKS3_SIZE                              0x1
#define _NCO1CLK_NCO1CKS3_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS3_MASK                              0x8
#define _NCO1CLK_NCO1PWS0_POSN                              0x5
#define _NCO1CLK_NCO1PWS0_POSITION                          0x5
#define _NCO1CLK_NCO1PWS0_SIZE                              0x1
#define _NCO1CLK_NCO1PWS0_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS0_MASK                              0x20
#define _NCO1CLK_NCO1PWS1_POSN                              0x6
#define _NCO1CLK_NCO1PWS1_POSITION                          0x6
#define _NCO1CLK_NCO1PWS1_SIZE                              0x1
#define _NCO1CLK_NCO1PWS1_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS1_MASK                              0x40
#define _NCO1CLK_NCO1PWS2_POSN                              0x7
#define _NCO1CLK_NCO1PWS2_POSITION                          0x7
#define _NCO1CLK_NCO1PWS2_SIZE                              0x1
#define _NCO1CLK_NCO1PWS2_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS2_MASK                              0x80

// Register: CWG3CLK
#define CWG3CLK CWG3CLK
extern volatile unsigned char           CWG3CLK             __at(0x3F40);
#ifndef _LIB_BUILD
asm("CWG3CLK equ 03F40h");
#endif
// aliases
extern volatile unsigned char           CWG3CLKCON          __at(0x3F40);
#ifndef _LIB_BUILD
asm("CWG3CLKCON equ 03F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG3CS                 :1;
    };
} CWG3CLKbits_t;
extern volatile CWG3CLKbits_t CWG3CLKbits __at(0x3F40);
// bitfield macros
#define _CWG3CLK_CS_POSN                                    0x0
#define _CWG3CLK_CS_POSITION                                0x0
#define _CWG3CLK_CS_SIZE                                    0x1
#define _CWG3CLK_CS_LENGTH                                  0x1
#define _CWG3CLK_CS_MASK                                    0x1
#define _CWG3CLK_CWG3CS_POSN                                0x0
#define _CWG3CLK_CWG3CS_POSITION                            0x0
#define _CWG3CLK_CWG3CS_SIZE                                0x1
#define _CWG3CLK_CWG3CS_LENGTH                              0x1
#define _CWG3CLK_CWG3CS_MASK                                0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG3CS                 :1;
    };
} CWG3CLKCONbits_t;
extern volatile CWG3CLKCONbits_t CWG3CLKCONbits __at(0x3F40);
// bitfield macros
#define _CWG3CLKCON_CS_POSN                                 0x0
#define _CWG3CLKCON_CS_POSITION                             0x0
#define _CWG3CLKCON_CS_SIZE                                 0x1
#define _CWG3CLKCON_CS_LENGTH                               0x1
#define _CWG3CLKCON_CS_MASK                                 0x1
#define _CWG3CLKCON_CWG3CS_POSN                             0x0
#define _CWG3CLKCON_CWG3CS_POSITION                         0x0
#define _CWG3CLKCON_CWG3CS_SIZE                             0x1
#define _CWG3CLKCON_CWG3CS_LENGTH                           0x1
#define _CWG3CLKCON_CWG3CS_MASK                             0x1

// Register: CWG3ISM
#define CWG3ISM CWG3ISM
extern volatile unsigned char           CWG3ISM             __at(0x3F41);
#ifndef _LIB_BUILD
asm("CWG3ISM equ 03F41h");
#endif
// aliases
extern volatile unsigned char           CWG3DAT             __at(0x3F41);
#ifndef _LIB_BUILD
asm("CWG3DAT equ 03F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG3ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG3ISMbits_t;
extern volatile CWG3ISMbits_t CWG3ISMbits __at(0x3F41);
// bitfield macros
#define _CWG3ISM_ISM_POSN                                   0x0
#define _CWG3ISM_ISM_POSITION                               0x0
#define _CWG3ISM_ISM_SIZE                                   0x8
#define _CWG3ISM_ISM_LENGTH                                 0x8
#define _CWG3ISM_ISM_MASK                                   0xFF
#define _CWG3ISM_CWG3ISM_POSN                               0x0
#define _CWG3ISM_CWG3ISM_POSITION                           0x0
#define _CWG3ISM_CWG3ISM_SIZE                               0x8
#define _CWG3ISM_CWG3ISM_LENGTH                             0x8
#define _CWG3ISM_CWG3ISM_MASK                               0xFF
#define _CWG3ISM_ISM0_POSN                                  0x0
#define _CWG3ISM_ISM0_POSITION                              0x0
#define _CWG3ISM_ISM0_SIZE                                  0x1
#define _CWG3ISM_ISM0_LENGTH                                0x1
#define _CWG3ISM_ISM0_MASK                                  0x1
#define _CWG3ISM_ISM1_POSN                                  0x1
#define _CWG3ISM_ISM1_POSITION                              0x1
#define _CWG3ISM_ISM1_SIZE                                  0x1
#define _CWG3ISM_ISM1_LENGTH                                0x1
#define _CWG3ISM_ISM1_MASK                                  0x2
#define _CWG3ISM_ISM2_POSN                                  0x2
#define _CWG3ISM_ISM2_POSITION                              0x2
#define _CWG3ISM_ISM2_SIZE                                  0x1
#define _CWG3ISM_ISM2_LENGTH                                0x1
#define _CWG3ISM_ISM2_MASK                                  0x4
#define _CWG3ISM_ISM3_POSN                                  0x3
#define _CWG3ISM_ISM3_POSITION                              0x3
#define _CWG3ISM_ISM3_SIZE                                  0x1
#define _CWG3ISM_ISM3_LENGTH                                0x1
#define _CWG3ISM_ISM3_MASK                                  0x8
#define _CWG3ISM_ISM4_POSN                                  0x4
#define _CWG3ISM_ISM4_POSITION                              0x4
#define _CWG3ISM_ISM4_SIZE                                  0x1
#define _CWG3ISM_ISM4_LENGTH                                0x1
#define _CWG3ISM_ISM4_MASK                                  0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG3ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG3DATbits_t;
extern volatile CWG3DATbits_t CWG3DATbits __at(0x3F41);
// bitfield macros
#define _CWG3DAT_ISM_POSN                                   0x0
#define _CWG3DAT_ISM_POSITION                               0x0
#define _CWG3DAT_ISM_SIZE                                   0x8
#define _CWG3DAT_ISM_LENGTH                                 0x8
#define _CWG3DAT_ISM_MASK                                   0xFF
#define _CWG3DAT_CWG3ISM_POSN                               0x0
#define _CWG3DAT_CWG3ISM_POSITION                           0x0
#define _CWG3DAT_CWG3ISM_SIZE                               0x8
#define _CWG3DAT_CWG3ISM_LENGTH                             0x8
#define _CWG3DAT_CWG3ISM_MASK                               0xFF
#define _CWG3DAT_ISM0_POSN                                  0x0
#define _CWG3DAT_ISM0_POSITION                              0x0
#define _CWG3DAT_ISM0_SIZE                                  0x1
#define _CWG3DAT_ISM0_LENGTH                                0x1
#define _CWG3DAT_ISM0_MASK                                  0x1
#define _CWG3DAT_ISM1_POSN                                  0x1
#define _CWG3DAT_ISM1_POSITION                              0x1
#define _CWG3DAT_ISM1_SIZE                                  0x1
#define _CWG3DAT_ISM1_LENGTH                                0x1
#define _CWG3DAT_ISM1_MASK                                  0x2
#define _CWG3DAT_ISM2_POSN                                  0x2
#define _CWG3DAT_ISM2_POSITION                              0x2
#define _CWG3DAT_ISM2_SIZE                                  0x1
#define _CWG3DAT_ISM2_LENGTH                                0x1
#define _CWG3DAT_ISM2_MASK                                  0x4
#define _CWG3DAT_ISM3_POSN                                  0x3
#define _CWG3DAT_ISM3_POSITION                              0x3
#define _CWG3DAT_ISM3_SIZE                                  0x1
#define _CWG3DAT_ISM3_LENGTH                                0x1
#define _CWG3DAT_ISM3_MASK                                  0x8
#define _CWG3DAT_ISM4_POSN                                  0x4
#define _CWG3DAT_ISM4_POSITION                              0x4
#define _CWG3DAT_ISM4_SIZE                                  0x1
#define _CWG3DAT_ISM4_LENGTH                                0x1
#define _CWG3DAT_ISM4_MASK                                  0x10

