GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
// Register: PWM8CON
#define PWM8CON PWM8CON
extern volatile unsigned char           PWM8CON             __at(0x3F62);
#ifndef _LIB_BUILD
asm("PWM8CON equ 03F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM8POL                :1;
        unsigned PWM8OUT                :1;
        unsigned                        :1;
        unsigned PWM8EN                 :1;
    };
} PWM8CONbits_t;
extern volatile PWM8CONbits_t PWM8CONbits __at(0x3F62);
// bitfield macros
#define _PWM8CON_POL_POSN                                   0x4
#define _PWM8CON_POL_POSITION                               0x4
#define _PWM8CON_POL_SIZE                                   0x1
#define _PWM8CON_POL_LENGTH                                 0x1
#define _PWM8CON_POL_MASK                                   0x10
#define _PWM8CON_OUT_POSN                                   0x5
#define _PWM8CON_OUT_POSITION                               0x5
#define _PWM8CON_OUT_SIZE                                   0x1
#define _PWM8CON_OUT_LENGTH                                 0x1
#define _PWM8CON_OUT_MASK                                   0x20
#define _PWM8CON_EN_POSN                                    0x7
#define _PWM8CON_EN_POSITION                                0x7
#define _PWM8CON_EN_SIZE                                    0x1
#define _PWM8CON_EN_LENGTH                                  0x1
#define _PWM8CON_EN_MASK                                    0x80
#define _PWM8CON_PWM8POL_POSN                               0x4
#define _PWM8CON_PWM8POL_POSITION                           0x4
#define _PWM8CON_PWM8POL_SIZE                               0x1
#define _PWM8CON_PWM8POL_LENGTH                             0x1
#define _PWM8CON_PWM8POL_MASK                               0x10
#define _PWM8CON_PWM8OUT_POSN                               0x5
#define _PWM8CON_PWM8OUT_POSITION                           0x5
#define _PWM8CON_PWM8OUT_SIZE                               0x1
#define _PWM8CON_PWM8OUT_LENGTH                             0x1
#define _PWM8CON_PWM8OUT_MASK                               0x20
#define _PWM8CON_PWM8EN_POSN                                0x7
#define _PWM8CON_PWM8EN_POSITION                            0x7
#define _PWM8CON_PWM8EN_SIZE                                0x1
#define _PWM8CON_PWM8EN_LENGTH                              0x1
#define _PWM8CON_PWM8EN_MASK                                0x80

// Register: PWM7DC
#define PWM7DC PWM7DC
extern volatile unsigned short          PWM7DC              __at(0x3F64);
#ifndef _LIB_BUILD
asm("PWM7DC equ 03F64h");
#endif

// Register: PWM7DCL
#define PWM7DCL PWM7DCL
extern volatile unsigned char           PWM7DCL             __at(0x3F64);
#ifndef _LIB_BUILD
asm("PWM7DCL equ 03F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM7DC0                :1;
        unsigned PWM7DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM7DCLbits_t;
extern volatile PWM7DCLbits_t PWM7DCLbits __at(0x3F64);
// bitfield macros
#define _PWM7DCL_DC_POSN                                    0x6
#define _PWM7DCL_DC_POSITION                                0x6
#define _PWM7DCL_DC_SIZE                                    0x2
#define _PWM7DCL_DC_LENGTH                                  0x2
#define _PWM7DCL_DC_MASK                                    0xC0
#define _PWM7DCL_DC0_POSN                                   0x6
#define _PWM7DCL_DC0_POSITION                               0x6
#define _PWM7DCL_DC0_SIZE                                   0x1
#define _PWM7DCL_DC0_LENGTH                                 0x1
#define _PWM7DCL_DC0_MASK                                   0x40
#define _PWM7DCL_DC1_POSN                                   0x7
#define _PWM7DCL_DC1_POSITION                               0x7
#define _PWM7DCL_DC1_SIZE                                   0x1
#define _PWM7DCL_DC1_LENGTH                                 0x1
#define _PWM7DCL_DC1_MASK                                   0x80
#define _PWM7DCL_PWM7DC0_POSN                               0x6
#define _PWM7DCL_PWM7DC0_POSITION                           0x6
#define _PWM7DCL_PWM7DC0_SIZE                               0x1
#define _PWM7DCL_PWM7DC0_LENGTH                             0x1
#define _PWM7DCL_PWM7DC0_MASK                               0x40
#define _PWM7DCL_PWM7DC1_POSN                               0x7
#define _PWM7DCL_PWM7DC1_POSITION                           0x7
#define _PWM7DCL_PWM7DC1_SIZE                               0x1
#define _PWM7DCL_PWM7DC1_LENGTH                             0x1
#define _PWM7DCL_PWM7DC1_MASK                               0x80
#define _PWM7DCL_PWMPW0_POSN                                0x6
#define _PWM7DCL_PWMPW0_POSITION                            0x6
#define _PWM7DCL_PWMPW0_SIZE                                0x1
#define _PWM7DCL_PWMPW0_LENGTH                              0x1
#define _PWM7DCL_PWMPW0_MASK                                0x40
#define _PWM7DCL_PWMPW1_POSN                                0x7
#define _PWM7DCL_PWMPW1_POSITION                            0x7
#define _PWM7DCL_PWMPW1_SIZE                                0x1
#define _PWM7DCL_PWMPW1_LENGTH                              0x1
#define _PWM7DCL_PWMPW1_MASK                                0x80

// Register: PWM7DCH
#define PWM7DCH PWM7DCH
extern volatile unsigned char           PWM7DCH             __at(0x3F65);
#ifndef _LIB_BUILD
asm("PWM7DCH equ 03F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM7DC2                :1;
        unsigned PWM7DC3                :1;
        unsigned PWM7DC4                :1;
        unsigned PWM7DC5                :1;
        unsigned PWM7DC6                :1;
        unsigned PWM7DC7                :1;
        unsigned PWM7DC8                :1;
        unsigned PWM7DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM7DCHbits_t;
extern volatile PWM7DCHbits_t PWM7DCHbits __at(0x3F65);
// bitfield macros
#define _PWM7DCH_DC_POSN                                    0x0
#define _PWM7DCH_DC_POSITION                                0x0
#define _PWM7DCH_DC_SIZE                                    0x8
#define _PWM7DCH_DC_LENGTH                                  0x8
#define _PWM7DCH_DC_MASK                                    0xFF
#define _PWM7DCH_DC2_POSN                                   0x0
#define _PWM7DCH_DC2_POSITION                               0x0
#define _PWM7DCH_DC2_SIZE                                   0x1
#define _PWM7DCH_DC2_LENGTH                                 0x1
#define _PWM7DCH_DC2_MASK                                   0x1
#define _PWM7DCH_DC3_POSN                                   0x1
#define _PWM7DCH_DC3_POSITION                               0x1
#define _PWM7DCH_DC3_SIZE                                   0x1
#define _PWM7DCH_DC3_LENGTH                                 0x1
#define _PWM7DCH_DC3_MASK                                   0x2
#define _PWM7DCH_DC4_POSN                                   0x2
#define _PWM7DCH_DC4_POSITION                               0x2
#define _PWM7DCH_DC4_SIZE                                   0x1
#define _PWM7DCH_DC4_LENGTH                                 0x1
#define _PWM7DCH_DC4_MASK                                   0x4
#define _PWM7DCH_DC5_POSN                                   0x3
#define _PWM7DCH_DC5_POSITION                               0x3
#define _PWM7DCH_DC5_SIZE                                   0x1
#define _PWM7DCH_DC5_LENGTH                                 0x1
#define _PWM7DCH_DC5_MASK                                   0x8
#define _PWM7DCH_DC6_POSN                                   0x4
#define _PWM7DCH_DC6_POSITION                               0x4
#define _PWM7DCH_DC6_SIZE                                   0x1
#define _PWM7DCH_DC6_LENGTH                                 0x1
#define _PWM7DCH_DC6_MASK                                   0x10
#define _PWM7DCH_DC7_POSN                                   0x5
#define _PWM7DCH_DC7_POSITION                               0x5
#define _PWM7DCH_DC7_SIZE                                   0x1
#define _PWM7DCH_DC7_LENGTH                                 0x1
#define _PWM7DCH_DC7_MASK                                   0x20
#define _PWM7DCH_DC8_POSN                                   0x6
#define _PWM7DCH_DC8_POSITION                               0x6
#define _PWM7DCH_DC8_SIZE                                   0x1
#define _PWM7DCH_DC8_LENGTH                                 0x1
#define _PWM7DCH_DC8_MASK                                   0x40
#define _PWM7DCH_DC9_POSN                                   0x7
#define _PWM7DCH_DC9_POSITION                               0x7
#define _PWM7DCH_DC9_SIZE                                   0x1
#define _PWM7DCH_DC9_LENGTH                                 0x1
#define _PWM7DCH_DC9_MASK                                   0x80
#define _PWM7DCH_PWM7DC2_POSN                               0x0
#define _PWM7DCH_PWM7DC2_POSITION                           0x0
#define _PWM7DCH_PWM7DC2_SIZE                               0x1
#define _PWM7DCH_PWM7DC2_LENGTH                             0x1
#define _PWM7DCH_PWM7DC2_MASK                               0x1
#define _PWM7DCH_PWM7DC3_POSN                               0x1
#define _PWM7DCH_PWM7DC3_POSITION                           0x1
#define _PWM7DCH_PWM7DC3_SIZE                               0x1
#define _PWM7DCH_PWM7DC3_LENGTH                             0x1
#define _PWM7DCH_PWM7DC3_MASK                               0x2
#define _PWM7DCH_PWM7DC4_POSN                               0x2
#define _PWM7DCH_PWM7DC4_POSITION                           0x2
#define _PWM7DCH_PWM7DC4_SIZE                               0x1
#define _PWM7DCH_PWM7DC4_LENGTH                             0x1
#define _PWM7DCH_PWM7DC4_MASK                               0x4
#define _PWM7DCH_PWM7DC5_POSN                               0x3
#define _PWM7DCH_PWM7DC5_POSITION                           0x3
#define _PWM7DCH_PWM7DC5_SIZE                               0x1
#define _PWM7DCH_PWM7DC5_LENGTH                             0x1
#define _PWM7DCH_PWM7DC5_MASK                               0x8
#define _PWM7DCH_PWM7DC6_POSN                               0x4
#define _PWM7DCH_PWM7DC6_POSITION                           0x4
#define _PWM7DCH_PWM7DC6_SIZE                               0x1
#define _PWM7DCH_PWM7DC6_LENGTH                             0x1
#define _PWM7DCH_PWM7DC6_MASK                               0x10
#define _PWM7DCH_PWM7DC7_POSN                               0x5
#define _PWM7DCH_PWM7DC7_POSITION                           0x5
#define _PWM7DCH_PWM7DC7_SIZE                               0x1
#define _PWM7DCH_PWM7DC7_LENGTH                             0x1
#define _PWM7DCH_PWM7DC7_MASK                               0x20
#define _PWM7DCH_PWM7DC8_POSN                               0x6
#define _PWM7DCH_PWM7DC8_POSITION                           0x6
#define _PWM7DCH_PWM7DC8_SIZE                               0x1
#define _PWM7DCH_PWM7DC8_LENGTH                             0x1
#define _PWM7DCH_PWM7DC8_MASK                               0x40
#define _PWM7DCH_PWM7DC9_POSN                               0x7
#define _PWM7DCH_PWM7DC9_POSITION                           0x7
#define _PWM7DCH_PWM7DC9_SIZE                               0x1
#define _PWM7DCH_PWM7DC9_LENGTH                             0x1
#define _PWM7DCH_PWM7DC9_MASK                               0x80
#define _PWM7DCH_PWMPW2_POSN                                0x0
#define _PWM7DCH_PWMPW2_POSITION                            0x0
#define _PWM7DCH_PWMPW2_SIZE                                0x1
#define _PWM7DCH_PWMPW2_LENGTH                              0x1
#define _PWM7DCH_PWMPW2_MASK                                0x1
#define _PWM7DCH_PWMPW3_POSN                                0x1
#define _PWM7DCH_PWMPW3_POSITION                            0x1
#define _PWM7DCH_PWMPW3_SIZE                                0x1
#define _PWM7DCH_PWMPW3_LENGTH                              0x1
#define _PWM7DCH_PWMPW3_MASK                                0x2
#define _PWM7DCH_PWMPW4_POSN                                0x2
#define _PWM7DCH_PWMPW4_POSITION                            0x2
#define _PWM7DCH_PWMPW4_SIZE                                0x1
#define _PWM7DCH_PWMPW4_LENGTH                              0x1
#define _PWM7DCH_PWMPW4_MASK                                0x4
#define _PWM7DCH_PWMPW5_POSN                                0x3
#define _PWM7DCH_PWMPW5_POSITION                            0x3
#define _PWM7DCH_PWMPW5_SIZE                                0x1
#define _PWM7DCH_PWMPW5_LENGTH                              0x1
#define _PWM7DCH_PWMPW5_MASK                                0x8
#define _PWM7DCH_PWMPW6_POSN                                0x4
#define _PWM7DCH_PWMPW6_POSITION                            0x4
#define _PWM7DCH_PWMPW6_SIZE                                0x1
#define _PWM7DCH_PWMPW6_LENGTH                              0x1
#define _PWM7DCH_PWMPW6_MASK                                0x10
#define _PWM7DCH_PWMPW7_POSN                                0x5
#define _PWM7DCH_PWMPW7_POSITION                            0x5
#define _PWM7DCH_PWMPW7_SIZE                                0x1
#define _PWM7DCH_PWMPW7_LENGTH                              0x1
#define _PWM7DCH_PWMPW7_MASK                                0x20
#define _PWM7DCH_PWMPW8_POSN                                0x6
#define _PWM7DCH_PWMPW8_POSITION                            0x6
#define _PWM7DCH_PWMPW8_SIZE                                0x1
#define _PWM7DCH_PWMPW8_LENGTH                              0x1
#define _PWM7DCH_PWMPW8_MASK                                0x40
#define _PWM7DCH_PWMPW9_POSN                                0x7
#define _PWM7DCH_PWMPW9_POSITION                            0x7
#define _PWM7DCH_PWMPW9_SIZE                                0x1
#define _PWM7DCH_PWMPW9_LENGTH                              0x1
#define _PWM7DCH_PWMPW9_MASK                                0x80

// Register: PWM7CON
#define PWM7CON PWM7CON
extern volatile unsigned char           PWM7CON             __at(0x3F66);
#ifndef _LIB_BUILD
asm("PWM7CON equ 03F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM7POL                :1;
        unsigned PWM7OUT                :1;
        unsigned                        :1;
        unsigned PWM7EN                 :1;
    };
} PWM7CONbits_t;
extern volatile PWM7CONbits_t PWM7CONbits __at(0x3F66);
// bitfield macros
#define _PWM7CON_POL_POSN                                   0x4
#define _PWM7CON_POL_POSITION                               0x4
#define _PWM7CON_POL_SIZE                                   0x1
#define _PWM7CON_POL_LENGTH                                 0x1
#define _PWM7CON_POL_MASK                                   0x10
#define _PWM7CON_OUT_POSN                                   0x5
#define _PWM7CON_OUT_POSITION                               0x5
#define _PWM7CON_OUT_SIZE                                   0x1
#define _PWM7CON_OUT_LENGTH                                 0x1
#define _PWM7CON_OUT_MASK                                   0x20
#define _PWM7CON_EN_POSN                                    0x7
#define _PWM7CON_EN_POSITION                                0x7
#define _PWM7CON_EN_SIZE                                    0x1
#define _PWM7CON_EN_LENGTH                                  0x1
#define _PWM7CON_EN_MASK                                    0x80
#define _PWM7CON_PWM7POL_POSN                               0x4
#define _PWM7CON_PWM7POL_POSITION                           0x4
#define _PWM7CON_PWM7POL_SIZE                               0x1
#define _PWM7CON_PWM7POL_LENGTH                             0x1
#define _PWM7CON_PWM7POL_MASK                               0x10
#define _PWM7CON_PWM7OUT_POSN                               0x5
#define _PWM7CON_PWM7OUT_POSITION                           0x5
#define _PWM7CON_PWM7OUT_SIZE                               0x1
#define _PWM7CON_PWM7OUT_LENGTH                             0x1
#define _PWM7CON_PWM7OUT_MASK                               0x20
#define _PWM7CON_PWM7EN_POSN                                0x7
#define _PWM7CON_PWM7EN_POSITION                            0x7
#define _PWM7CON_PWM7EN_SIZE                                0x1
#define _PWM7CON_PWM7EN_LENGTH                              0x1
#define _PWM7CON_PWM7EN_MASK                                0x80

// Register: PWM6DC
#define PWM6DC PWM6DC
extern volatile unsigned short          PWM6DC              __at(0x3F68);
#ifndef _LIB_BUILD
asm("PWM6DC equ 03F68h");
#endif

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0x3F68);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 03F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM6DC0                :1;
        unsigned PWM6DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0x3F68);
// bitfield macros
#define _PWM6DCL_DC_POSN                                    0x6
#define _PWM6DCL_DC_POSITION                                0x6
#define _PWM6DCL_DC_SIZE                                    0x2
#define _PWM6DCL_DC_LENGTH                                  0x2
#define _PWM6DCL_DC_MASK                                    0xC0
#define _PWM6DCL_DC0_POSN                                   0x6
#define _PWM6DCL_DC0_POSITION                               0x6
#define _PWM6DCL_DC0_SIZE                                   0x1
#define _PWM6DCL_DC0_LENGTH                                 0x1
#define _PWM6DCL_DC0_MASK                                   0x40
#define _PWM6DCL_DC1_POSN                                   0x7
#define _PWM6DCL_DC1_POSITION                               0x7
#define _PWM6DCL_DC1_SIZE                                   0x1
#define _PWM6DCL_DC1_LENGTH                                 0x1
#define _PWM6DCL_DC1_MASK                                   0x80
#define _PWM6DCL_PWM6DC0_POSN                               0x6
#define _PWM6DCL_PWM6DC0_POSITION                           0x6
#define _PWM6DCL_PWM6DC0_SIZE                               0x1
#define _PWM6DCL_PWM6DC0_LENGTH                             0x1
#define _PWM6DCL_PWM6DC0_MASK                               0x40
#define _PWM6DCL_PWM6DC1_POSN                               0x7
#define _PWM6DCL_PWM6DC1_POSITION                           0x7
#define _PWM6DCL_PWM6DC1_SIZE                               0x1
#define _PWM6DCL_PWM6DC1_LENGTH                             0x1
#define _PWM6DCL_PWM6DC1_MASK                               0x80
#define _PWM6DCL_PWMPW0_POSN                                0x6
#define _PWM6DCL_PWMPW0_POSITION                            0x6
#define _PWM6DCL_PWMPW0_SIZE                                0x1
#define _PWM6DCL_PWMPW0_LENGTH                              0x1
#define _PWM6DCL_PWMPW0_MASK                                0x40
#define _PWM6DCL_PWMPW1_POSN                                0x7
#define _PWM6DCL_PWMPW1_POSITION                            0x7
#define _PWM6DCL_PWMPW1_SIZE                                0x1
#define _PWM6DCL_PWMPW1_LENGTH                              0x1
#define _PWM6DCL_PWMPW1_MASK                                0x80

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0x3F69);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 03F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM6DC2                :1;
        unsigned PWM6DC3                :1;
        unsigned PWM6DC4                :1;
        unsigned PWM6DC5                :1;
        unsigned PWM6DC6                :1;
        unsigned PWM6DC7                :1;
        unsigned PWM6DC8                :1;
        unsigned PWM6DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM6DCHbits_t;
