GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
extern volatile __bit                   DMA1SCNT6           __at(0x1DF96);	// @ (0x3BF2 * 8 + 6)
#define                                 DMA1SCNT6_bit       _BIT_ACCESS(DMA1SCNTL,6)
// DMA1SCNTL<DMA1SCNT7>
extern volatile __bit                   DMA1SCNT7           __at(0x1DF97);	// @ (0x3BF2 * 8 + 7)
#define                                 DMA1SCNT7_bit       _BIT_ACCESS(DMA1SCNTL,7)
// DMA1SCNTH<DMA1SCNT8>
extern volatile __bit                   DMA1SCNT8           __at(0x1DF98);	// @ (0x3BF3 * 8 + 0)
#define                                 DMA1SCNT8_bit       _BIT_ACCESS(DMA1SCNTH,0)
// DMA1SCNTH<DMA1SCNT9>
extern volatile __bit                   DMA1SCNT9           __at(0x1DF99);	// @ (0x3BF3 * 8 + 1)
#define                                 DMA1SCNT9_bit       _BIT_ACCESS(DMA1SCNTH,1)
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x1CC90);	// @ (0x3992 * 8 + 0)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE2,0)
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x1CD10);	// @ (0x39A2 * 8 + 0)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR2,0)
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x1CC10);	// @ (0x3982 * 8 + 0)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR2,0)
// DMA1SIRQ<DMA1SIRQ0>
extern volatile __bit                   DMA1SIRQ0           __at(0x1DFF8);	// @ (0x3BFF * 8 + 0)
#define                                 DMA1SIRQ0_bit       _BIT_ACCESS(DMA1SIRQ,0)
// DMA1SIRQ<DMA1SIRQ1>
extern volatile __bit                   DMA1SIRQ1           __at(0x1DFF9);	// @ (0x3BFF * 8 + 1)
#define                                 DMA1SIRQ1_bit       _BIT_ACCESS(DMA1SIRQ,1)
// DMA1SIRQ<DMA1SIRQ2>
extern volatile __bit                   DMA1SIRQ2           __at(0x1DFFA);	// @ (0x3BFF * 8 + 2)
#define                                 DMA1SIRQ2_bit       _BIT_ACCESS(DMA1SIRQ,2)
// DMA1SIRQ<DMA1SIRQ3>
extern volatile __bit                   DMA1SIRQ3           __at(0x1DFFB);	// @ (0x3BFF * 8 + 3)
#define                                 DMA1SIRQ3_bit       _BIT_ACCESS(DMA1SIRQ,3)
// DMA1SIRQ<DMA1SIRQ4>
extern volatile __bit                   DMA1SIRQ4           __at(0x1DFFC);	// @ (0x3BFF * 8 + 4)
#define                                 DMA1SIRQ4_bit       _BIT_ACCESS(DMA1SIRQ,4)
// DMA1SIRQ<DMA1SIRQ5>
extern volatile __bit                   DMA1SIRQ5           __at(0x1DFFD);	// @ (0x3BFF * 8 + 5)
#define                                 DMA1SIRQ5_bit       _BIT_ACCESS(DMA1SIRQ,5)
// DMA1SIRQ<DMA1SIRQ6>
extern volatile __bit                   DMA1SIRQ6           __at(0x1DFFE);	// @ (0x3BFF * 8 + 6)
#define                                 DMA1SIRQ6_bit       _BIT_ACCESS(DMA1SIRQ,6)
// DMA1CON0<DMA1SIRQEN>
extern volatile __bit                   DMA1SIRQEN          __at(0x1DFE6);	// @ (0x3BFC * 8 + 6)
#define                                 DMA1SIRQEN_bit      _BIT_ACCESS(DMA1CON0,6)
// DMA1SPTRL<DMA1SPTR0>
extern volatile __bit                   DMA1SPTR0           __at(0x1DFA0);	// @ (0x3BF4 * 8 + 0)
#define                                 DMA1SPTR0_bit       _BIT_ACCESS(DMA1SPTRL,0)
// DMA1SPTRL<DMA1SPTR1>
extern volatile __bit                   DMA1SPTR1           __at(0x1DFA1);	// @ (0x3BF4 * 8 + 1)
#define                                 DMA1SPTR1_bit       _BIT_ACCESS(DMA1SPTRL,1)
// DMA1SPTRH<DMA1SPTR10>
extern volatile __bit                   DMA1SPTR10          __at(0x1DFAA);	// @ (0x3BF5 * 8 + 2)
#define                                 DMA1SPTR10_bit      _BIT_ACCESS(DMA1SPTRH,2)
// DMA1SPTRH<DMA1SPTR11>
extern volatile __bit                   DMA1SPTR11          __at(0x1DFAB);	// @ (0x3BF5 * 8 + 3)
#define                                 DMA1SPTR11_bit      _BIT_ACCESS(DMA1SPTRH,3)
// DMA1SPTRH<DMA1SPTR12>
extern volatile __bit                   DMA1SPTR12          __at(0x1DFAC);	// @ (0x3BF5 * 8 + 4)
#define                                 DMA1SPTR12_bit      _BIT_ACCESS(DMA1SPTRH,4)
// DMA1SPTRH<DMA1SPTR13>
extern volatile __bit                   DMA1SPTR13          __at(0x1DFAD);	// @ (0x3BF5 * 8 + 5)
#define                                 DMA1SPTR13_bit      _BIT_ACCESS(DMA1SPTRH,5)
// DMA1SPTRH<DMA1SPTR14>
extern volatile __bit                   DMA1SPTR14          __at(0x1DFAE);	// @ (0x3BF5 * 8 + 6)
#define                                 DMA1SPTR14_bit      _BIT_ACCESS(DMA1SPTRH,6)
// DMA1SPTRH<DMA1SPTR15>
extern volatile __bit                   DMA1SPTR15          __at(0x1DFAF);	// @ (0x3BF5 * 8 + 7)
#define                                 DMA1SPTR15_bit      _BIT_ACCESS(DMA1SPTRH,7)
// DMA1SPTRU<DMA1SPTR16>
extern volatile __bit                   DMA1SPTR16          __at(0x1DFB0);	// @ (0x3BF6 * 8 + 0)
#define                                 DMA1SPTR16_bit      _BIT_ACCESS(DMA1SPTRU,0)
// DMA1SPTRU<DMA1SPTR17>
extern volatile __bit                   DMA1SPTR17          __at(0x1DFB1);	// @ (0x3BF6 * 8 + 1)
#define                                 DMA1SPTR17_bit      _BIT_ACCESS(DMA1SPTRU,1)
// DMA1SPTRU<DMA1SPTR18>
extern volatile __bit                   DMA1SPTR18          __at(0x1DFB2);	// @ (0x3BF6 * 8 + 2)
#define                                 DMA1SPTR18_bit      _BIT_ACCESS(DMA1SPTRU,2)
// DMA1SPTRU<DMA1SPTR19>
extern volatile __bit                   DMA1SPTR19          __at(0x1DFB3);	// @ (0x3BF6 * 8 + 3)
#define                                 DMA1SPTR19_bit      _BIT_ACCESS(DMA1SPTRU,3)
// DMA1SPTRL<DMA1SPTR2>
extern volatile __bit                   DMA1SPTR2           __at(0x1DFA2);	// @ (0x3BF4 * 8 + 2)
#define                                 DMA1SPTR2_bit       _BIT_ACCESS(DMA1SPTRL,2)
// DMA1SPTRU<DMA1SPTR20>
extern volatile __bit                   DMA1SPTR20          __at(0x1DFB4);	// @ (0x3BF6 * 8 + 4)
#define                                 DMA1SPTR20_bit      _BIT_ACCESS(DMA1SPTRU,4)
// DMA1SPTRU<DMA1SPTR21>
extern volatile __bit                   DMA1SPTR21          __at(0x1DFB5);	// @ (0x3BF6 * 8 + 5)
#define                                 DMA1SPTR21_bit      _BIT_ACCESS(DMA1SPTRU,5)
// DMA1SPTRL<DMA1SPTR3>
extern volatile __bit                   DMA1SPTR3           __at(0x1DFA3);	// @ (0x3BF4 * 8 + 3)
#define                                 DMA1SPTR3_bit       _BIT_ACCESS(DMA1SPTRL,3)
// DMA1SPTRL<DMA1SPTR4>
extern volatile __bit                   DMA1SPTR4           __at(0x1DFA4);	// @ (0x3BF4 * 8 + 4)
#define                                 DMA1SPTR4_bit       _BIT_ACCESS(DMA1SPTRL,4)
// DMA1SPTRL<DMA1SPTR5>
extern volatile __bit                   DMA1SPTR5           __at(0x1DFA5);	// @ (0x3BF4 * 8 + 5)
#define                                 DMA1SPTR5_bit       _BIT_ACCESS(DMA1SPTRL,5)
// DMA1SPTRL<DMA1SPTR6>
extern volatile __bit                   DMA1SPTR6           __at(0x1DFA6);	// @ (0x3BF4 * 8 + 6)
#define                                 DMA1SPTR6_bit       _BIT_ACCESS(DMA1SPTRL,6)
// DMA1SPTRL<DMA1SPTR7>
extern volatile __bit                   DMA1SPTR7           __at(0x1DFA7);	// @ (0x3BF4 * 8 + 7)
#define                                 DMA1SPTR7_bit       _BIT_ACCESS(DMA1SPTRL,7)
// DMA1SPTRH<DMA1SPTR8>
extern volatile __bit                   DMA1SPTR8           __at(0x1DFA8);	// @ (0x3BF5 * 8 + 0)
#define                                 DMA1SPTR8_bit       _BIT_ACCESS(DMA1SPTRH,0)
// DMA1SPTRH<DMA1SPTR9>
extern volatile __bit                   DMA1SPTR9           __at(0x1DFA9);	// @ (0x3BF5 * 8 + 1)
#define                                 DMA1SPTR9_bit       _BIT_ACCESS(DMA1SPTRH,1)
// DMA1SSAL<DMA1SSA0>
extern volatile __bit                   DMA1SSA0            __at(0x1DFC8);	// @ (0x3BF9 * 8 + 0)
#define                                 DMA1SSA0_bit        _BIT_ACCESS(DMA1SSAL,0)
// DMA1SSAL<DMA1SSA1>
extern volatile __bit                   DMA1SSA1            __at(0x1DFC9);	// @ (0x3BF9 * 8 + 1)
#define                                 DMA1SSA1_bit        _BIT_ACCESS(DMA1SSAL,1)
// DMA1SSAH<DMA1SSA10>
extern volatile __bit                   DMA1SSA10           __at(0x1DFD2);	// @ (0x3BFA * 8 + 2)
#define                                 DMA1SSA10_bit       _BIT_ACCESS(DMA1SSAH,2)
// DMA1SSAH<DMA1SSA11>
extern volatile __bit                   DMA1SSA11           __at(0x1DFD3);	// @ (0x3BFA * 8 + 3)
#define                                 DMA1SSA11_bit       _BIT_ACCESS(DMA1SSAH,3)
// DMA1SSAH<DMA1SSA12>
extern volatile __bit                   DMA1SSA12           __at(0x1DFD4);	// @ (0x3BFA * 8 + 4)
#define                                 DMA1SSA12_bit       _BIT_ACCESS(DMA1SSAH,4)
// DMA1SSAH<DMA1SSA13>
extern volatile __bit                   DMA1SSA13           __at(0x1DFD5);	// @ (0x3BFA * 8 + 5)
#define                                 DMA1SSA13_bit       _BIT_ACCESS(DMA1SSAH,5)
// DMA1SSAH<DMA1SSA14>
extern volatile __bit                   DMA1SSA14           __at(0x1DFD6);	// @ (0x3BFA * 8 + 6)
#define                                 DMA1SSA14_bit       _BIT_ACCESS(DMA1SSAH,6)
// DMA1SSAH<DMA1SSA15>
extern volatile __bit                   DMA1SSA15           __at(0x1DFD7);	// @ (0x3BFA * 8 + 7)
#define                                 DMA1SSA15_bit       _BIT_ACCESS(DMA1SSAH,7)
// DMA1SSAU<DMA1SSA16>
extern volatile __bit                   DMA1SSA16           __at(0x1DFD8);	// @ (0x3BFB * 8 + 0)
#define                                 DMA1SSA16_bit       _BIT_ACCESS(DMA1SSAU,0)
// DMA1SSAU<DMA1SSA17>
extern volatile __bit                   DMA1SSA17           __at(0x1DFD9);	// @ (0x3BFB * 8 + 1)
#define                                 DMA1SSA17_bit       _BIT_ACCESS(DMA1SSAU,1)
// DMA1SSAU<DMA1SSA18>
extern volatile __bit                   DMA1SSA18           __at(0x1DFDA);	// @ (0x3BFB * 8 + 2)
#define                                 DMA1SSA18_bit       _BIT_ACCESS(DMA1SSAU,2)
// DMA1SSAU<DMA1SSA19>
extern volatile __bit                   DMA1SSA19           __at(0x1DFDB);	// @ (0x3BFB * 8 + 3)
#define                                 DMA1SSA19_bit       _BIT_ACCESS(DMA1SSAU,3)
// DMA1SSAL<DMA1SSA2>
extern volatile __bit                   DMA1SSA2            __at(0x1DFCA);	// @ (0x3BF9 * 8 + 2)
#define                                 DMA1SSA2_bit        _BIT_ACCESS(DMA1SSAL,2)
// DMA1SSAU<DMA1SSA20>
extern volatile __bit                   DMA1SSA20           __at(0x1DFDC);	// @ (0x3BFB * 8 + 4)
#define                                 DMA1SSA20_bit       _BIT_ACCESS(DMA1SSAU,4)
// DMA1SSAU<DMA1SSA21>
extern volatile __bit                   DMA1SSA21           __at(0x1DFDD);	// @ (0x3BFB * 8 + 5)
#define                                 DMA1SSA21_bit       _BIT_ACCESS(DMA1SSAU,5)
// DMA1SSAL<DMA1SSA3>
extern volatile __bit                   DMA1SSA3            __at(0x1DFCB);	// @ (0x3BF9 * 8 + 3)
#define                                 DMA1SSA3_bit        _BIT_ACCESS(DMA1SSAL,3)
// DMA1SSAL<DMA1SSA4>
extern volatile __bit                   DMA1SSA4            __at(0x1DFCC);	// @ (0x3BF9 * 8 + 4)
#define                                 DMA1SSA4_bit        _BIT_ACCESS(DMA1SSAL,4)
// DMA1SSAL<DMA1SSA5>
extern volatile __bit                   DMA1SSA5            __at(0x1DFCD);	// @ (0x3BF9 * 8 + 5)
#define                                 DMA1SSA5_bit        _BIT_ACCESS(DMA1SSAL,5)
// DMA1SSAL<DMA1SSA6>
extern volatile __bit                   DMA1SSA6            __at(0x1DFCE);	// @ (0x3BF9 * 8 + 6)
#define                                 DMA1SSA6_bit        _BIT_ACCESS(DMA1SSAL,6)
// DMA1SSAL<DMA1SSA7>
extern volatile __bit                   DMA1SSA7            __at(0x1DFCF);	// @ (0x3BF9 * 8 + 7)
#define                                 DMA1SSA7_bit        _BIT_ACCESS(DMA1SSAL,7)
// DMA1SSAH<DMA1SSA8>
extern volatile __bit                   DMA1SSA8            __at(0x1DFD0);	// @ (0x3BFA * 8 + 0)
#define                                 DMA1SSA8_bit        _BIT_ACCESS(DMA1SSAH,0)
// DMA1SSAH<DMA1SSA9>
extern volatile __bit                   DMA1SSA9            __at(0x1DFD1);	// @ (0x3BFA * 8 + 1)
#define                                 DMA1SSA9_bit        _BIT_ACCESS(DMA1SSAH,1)
// DMA1SSZL<DMA1SSZ0>
extern volatile __bit                   DMA1SSZ0            __at(0x1DFB8);	// @ (0x3BF7 * 8 + 0)
#define                                 DMA1SSZ0_bit        _BIT_ACCESS(DMA1SSZL,0)
// DMA1SSZL<DMA1SSZ1>
extern volatile __bit                   DMA1SSZ1            __at(0x1DFB9);	// @ (0x3BF7 * 8 + 1)
#define                                 DMA1SSZ1_bit        _BIT_ACCESS(DMA1SSZL,1)
// DMA1SSZH<DMA1SSZ10>
extern volatile __bit                   DMA1SSZ10           __at(0x1DFC2);	// @ (0x3BF8 * 8 + 2)
#define                                 DMA1SSZ10_bit       _BIT_ACCESS(DMA1SSZH,2)
// DMA1SSZH<DMA1SSZ11>
extern volatile __bit                   DMA1SSZ11           __at(0x1DFC3);	// @ (0x3BF8 * 8 + 3)
#define                                 DMA1SSZ11_bit       _BIT_ACCESS(DMA1SSZH,3)
// DMA1SSZL<DMA1SSZ2>
extern volatile __bit                   DMA1SSZ2            __at(0x1DFBA);	// @ (0x3BF7 * 8 + 2)
#define                                 DMA1SSZ2_bit        _BIT_ACCESS(DMA1SSZL,2)
// DMA1SSZL<DMA1SSZ3>
extern volatile __bit                   DMA1SSZ3            __at(0x1DFBB);	// @ (0x3BF7 * 8 + 3)
#define                                 DMA1SSZ3_bit        _BIT_ACCESS(DMA1SSZL,3)
// DMA1SSZL<DMA1SSZ4>
extern volatile __bit                   DMA1SSZ4            __at(0x1DFBC);	// @ (0x3BF7 * 8 + 4)
#define                                 DMA1SSZ4_bit        _BIT_ACCESS(DMA1SSZL,4)
// DMA1SSZL<DMA1SSZ5>
extern volatile __bit                   DMA1SSZ5            __at(0x1DFBD);	// @ (0x3BF7 * 8 + 5)
#define                                 DMA1SSZ5_bit        _BIT_ACCESS(DMA1SSZL,5)
// DMA1SSZL<DMA1SSZ6>
extern volatile __bit                   DMA1SSZ6            __at(0x1DFBE);	// @ (0x3BF7 * 8 + 6)
#define                                 DMA1SSZ6_bit        _BIT_ACCESS(DMA1SSZL,6)
// DMA1SSZL<DMA1SSZ7>
extern volatile __bit                   DMA1SSZ7            __at(0x1DFBF);	// @ (0x3BF7 * 8 + 7)
#define                                 DMA1SSZ7_bit        _BIT_ACCESS(DMA1SSZL,7)
// DMA1SSZH<DMA1SSZ8>
extern volatile __bit                   DMA1SSZ8            __at(0x1DFC0);	// @ (0x3BF8 * 8 + 0)
#define                                 DMA1SSZ8_bit        _BIT_ACCESS(DMA1SSZH,0)
// DMA1SSZH<DMA1SSZ9>
extern volatile __bit                   DMA1SSZ9            __at(0x1DFC1);	// @ (0x3BF8 * 8 + 1)
#define                                 DMA1SSZ9_bit        _BIT_ACCESS(DMA1SSZH,1)
// DMA1CON0<DMA1XIP>
extern volatile __bit                   DMA1XIP             __at(0x1DFE0);	// @ (0x3BFC * 8 + 0)
#define                                 DMA1XIP_bit         _BIT_ACCESS(DMA1CON0,0)
// PIE5<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x1CCAD);	// @ (0x3995 * 8 + 5)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE5,5)
// PIR5<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x1CD2D);	// @ (0x39A5 * 8 + 5)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR5,5)
// IPR5<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x1CC2D);	// @ (0x3985 * 8 + 5)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR5,5)
// DMA2AIRQ<DMA2AIRQ0>
extern volatile __bit                   DMA2AIRQ0           __at(0x1DEF0);	// @ (0x3BDE * 8 + 0)
#define                                 DMA2AIRQ0_bit       _BIT_ACCESS(DMA2AIRQ,0)
// DMA2AIRQ<DMA2AIRQ1>
extern volatile __bit                   DMA2AIRQ1           __at(0x1DEF1);	// @ (0x3BDE * 8 + 1)
#define                                 DMA2AIRQ1_bit       _BIT_ACCESS(DMA2AIRQ,1)
// DMA2AIRQ<DMA2AIRQ2>
extern volatile __bit                   DMA2AIRQ2           __at(0x1DEF2);	// @ (0x3BDE * 8 + 2)
#define                                 DMA2AIRQ2_bit       _BIT_ACCESS(DMA2AIRQ,2)
// DMA2AIRQ<DMA2AIRQ3>
extern volatile __bit                   DMA2AIRQ3           __at(0x1DEF3);	// @ (0x3BDE * 8 + 3)
#define                                 DMA2AIRQ3_bit       _BIT_ACCESS(DMA2AIRQ,3)
// DMA2AIRQ<DMA2AIRQ4>
extern volatile __bit                   DMA2AIRQ4           __at(0x1DEF4);	// @ (0x3BDE * 8 + 4)
#define                                 DMA2AIRQ4_bit       _BIT_ACCESS(DMA2AIRQ,4)
// DMA2AIRQ<DMA2AIRQ5>
extern volatile __bit                   DMA2AIRQ5           __at(0x1DEF5);	// @ (0x3BDE * 8 + 5)
#define                                 DMA2AIRQ5_bit       _BIT_ACCESS(DMA2AIRQ,5)
// DMA2AIRQ<DMA2AIRQ6>
extern volatile __bit                   DMA2AIRQ6           __at(0x1DEF6);	// @ (0x3BDE * 8 + 6)
#define                                 DMA2AIRQ6_bit       _BIT_ACCESS(DMA2AIRQ,6)
// DMA2CON0<DMA2AIRQEN>
extern volatile __bit                   DMA2AIRQEN          __at(0x1DEE2);	// @ (0x3BDC * 8 + 2)
#define                                 DMA2AIRQEN_bit      _BIT_ACCESS(DMA2CON0,2)
// DMA2BUF<DMA2BUF0>
extern volatile __bit                   DMA2BUF0            __at(0x1DE48);	// @ (0x3BC9 * 8 + 0)
#define                                 DMA2BUF0_bit        _BIT_ACCESS(DMA2BUF,0)
// DMA2BUF<DMA2BUF1>
extern volatile __bit                   DMA2BUF1            __at(0x1DE49);	// @ (0x3BC9 * 8 + 1)
#define                                 DMA2BUF1_bit        _BIT_ACCESS(DMA2BUF,1)
// DMA2BUF<DMA2BUF2>
extern volatile __bit                   DMA2BUF2            __at(0x1DE4A);	// @ (0x3BC9 * 8 + 2)
#define                                 DMA2BUF2_bit        _BIT_ACCESS(DMA2BUF,2)
// DMA2BUF<DMA2BUF3>
extern volatile __bit                   DMA2BUF3            __at(0x1DE4B);	// @ (0x3BC9 * 8 + 3)
#define                                 DMA2BUF3_bit        _BIT_ACCESS(DMA2BUF,3)
// DMA2BUF<DMA2BUF4>
extern volatile __bit                   DMA2BUF4            __at(0x1DE4C);	// @ (0x3BC9 * 8 + 4)
#define                                 DMA2BUF4_bit        _BIT_ACCESS(DMA2BUF,4)
// DMA2BUF<DMA2BUF5>
extern volatile __bit                   DMA2BUF5            __at(0x1DE4D);	// @ (0x3BC9 * 8 + 5)
#define                                 DMA2BUF5_bit        _BIT_ACCESS(DMA2BUF,5)
// DMA2BUF<DMA2BUF6>
extern volatile __bit                   DMA2BUF6            __at(0x1DE4E);	// @ (0x3BC9 * 8 + 6)
#define                                 DMA2BUF6_bit        _BIT_ACCESS(DMA2BUF,6)
// DMA2BUF<DMA2BUF7>
extern volatile __bit                   DMA2BUF7            __at(0x1DE4F);	// @ (0x3BC9 * 8 + 7)
#define                                 DMA2BUF7_bit        _BIT_ACCESS(DMA2BUF,7)
// DMA2DCNTL<DMA2DCNT0>
extern volatile __bit                   DMA2DCNT0           __at(0x1DE50);	// @ (0x3BCA * 8 + 0)
#define                                 DMA2DCNT0_bit       _BIT_ACCESS(DMA2DCNTL,0)
// DMA2DCNTL<DMA2DCNT1>
extern volatile __bit                   DMA2DCNT1           __at(0x1DE51);	// @ (0x3BCA * 8 + 1)
#define                                 DMA2DCNT1_bit       _BIT_ACCESS(DMA2DCNTL,1)
// DMA2DCNTH<DMA2DCNT10>
extern volatile __bit                   DMA2DCNT10          __at(0x1DE5A);	// @ (0x3BCB * 8 + 2)
#define                                 DMA2DCNT10_bit      _BIT_ACCESS(DMA2DCNTH,2)
// DMA2DCNTH<DMA2DCNT11>
extern volatile __bit                   DMA2DCNT11          __at(0x1DE5B);	// @ (0x3BCB * 8 + 3)
#define                                 DMA2DCNT11_bit      _BIT_ACCESS(DMA2DCNTH,3)
// DMA2DCNTL<DMA2DCNT2>
extern volatile __bit                   DMA2DCNT2           __at(0x1DE52);	// @ (0x3BCA * 8 + 2)
#define                                 DMA2DCNT2_bit       _BIT_ACCESS(DMA2DCNTL,2)
// DMA2DCNTL<DMA2DCNT3>
extern volatile __bit                   DMA2DCNT3           __at(0x1DE53);	// @ (0x3BCA * 8 + 3)
#define                                 DMA2DCNT3_bit       _BIT_ACCESS(DMA2DCNTL,3)
// DMA2DCNTL<DMA2DCNT4>
extern volatile __bit                   DMA2DCNT4           __at(0x1DE54);	// @ (0x3BCA * 8 + 4)
#define                                 DMA2DCNT4_bit       _BIT_ACCESS(DMA2DCNTL,4)
// DMA2DCNTL<DMA2DCNT5>
extern volatile __bit                   DMA2DCNT5           __at(0x1DE55);	// @ (0x3BCA * 8 + 5)
#define                                 DMA2DCNT5_bit       _BIT_ACCESS(DMA2DCNTL,5)
// DMA2DCNTL<DMA2DCNT6>
extern volatile __bit                   DMA2DCNT6           __at(0x1DE56);	// @ (0x3BCA * 8 + 6)
#define                                 DMA2DCNT6_bit       _BIT_ACCESS(DMA2DCNTL,6)
// DMA2DCNTL<DMA2DCNT7>
extern volatile __bit                   DMA2DCNT7           __at(0x1DE57);	// @ (0x3BCA * 8 + 7)
#define                                 DMA2DCNT7_bit       _BIT_ACCESS(DMA2DCNTL,7)
// DMA2DCNTH<DMA2DCNT8>
extern volatile __bit                   DMA2DCNT8           __at(0x1DE58);	// @ (0x3BCB * 8 + 0)
#define                                 DMA2DCNT8_bit       _BIT_ACCESS(DMA2DCNTH,0)
// DMA2DCNTH<DMA2DCNT9>
extern volatile __bit                   DMA2DCNT9           __at(0x1DE59);	// @ (0x3BCB * 8 + 1)
#define                                 DMA2DCNT9_bit       _BIT_ACCESS(DMA2DCNTH,1)
// PIE5<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x1CCAB);	// @ (0x3995 * 8 + 3)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE5,3)
// PIR5<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x1CD2B);	// @ (0x39A5 * 8 + 3)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR5,3)
// IPR5<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x1CC2B);	// @ (0x3985 * 8 + 3)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR5,3)
// DMA2CON0<DMA2DGO>
extern volatile __bit                   DMA2DGO             __at(0x1DEE5);	// @ (0x3BDC * 8 + 5)
#define                                 DMA2DGO_bit         _BIT_ACCESS(DMA2CON0,5)
// DMA2DPTRL<DMA2DPTR0>
extern volatile __bit                   DMA2DPTR0           __at(0x1DE60);	// @ (0x3BCC * 8 + 0)
#define                                 DMA2DPTR0_bit       _BIT_ACCESS(DMA2DPTRL,0)
// DMA2DPTRL<DMA2DPTR1>
extern volatile __bit                   DMA2DPTR1           __at(0x1DE61);	// @ (0x3BCC * 8 + 1)
#define                                 DMA2DPTR1_bit       _BIT_ACCESS(DMA2DPTRL,1)
// DMA2DPTRH<DMA2DPTR10>
extern volatile __bit                   DMA2DPTR10          __at(0x1DE6A);	// @ (0x3BCD * 8 + 2)
#define                                 DMA2DPTR10_bit      _BIT_ACCESS(DMA2DPTRH,2)
// DMA2DPTRH<DMA2DPTR11>
extern volatile __bit                   DMA2DPTR11          __at(0x1DE6B);	// @ (0x3BCD * 8 + 3)
#define                                 DMA2DPTR11_bit      _BIT_ACCESS(DMA2DPTRH,3)
// DMA2DPTRH<DMA2DPTR12>
extern volatile __bit                   DMA2DPTR12          __at(0x1DE6C);	// @ (0x3BCD * 8 + 4)
#define                                 DMA2DPTR12_bit      _BIT_ACCESS(DMA2DPTRH,4)
// DMA2DPTRH<DMA2DPTR13>
extern volatile __bit                   DMA2DPTR13          __at(0x1DE6D);	// @ (0x3BCD * 8 + 5)
#define                                 DMA2DPTR13_bit      _BIT_ACCESS(DMA2DPTRH,5)
// DMA2DPTRH<DMA2DPTR14>
extern volatile __bit                   DMA2DPTR14          __at(0x1DE6E);	// @ (0x3BCD * 8 + 6)
#define                                 DMA2DPTR14_bit      _BIT_ACCESS(DMA2DPTRH,6)
// DMA2DPTRH<DMA2DPTR15>
extern volatile __bit                   DMA2DPTR15          __at(0x1DE6F);	// @ (0x3BCD * 8 + 7)
#define                                 DMA2DPTR15_bit      _BIT_ACCESS(DMA2DPTRH,7)
// DMA2DPTRL<DMA2DPTR2>
extern volatile __bit                   DMA2DPTR2           __at(0x1DE62);	// @ (0x3BCC * 8 + 2)
#define                                 DMA2DPTR2_bit       _BIT_ACCESS(DMA2DPTRL,2)
// DMA2DPTRL<DMA2DPTR3>
extern volatile __bit                   DMA2DPTR3           __at(0x1DE63);	// @ (0x3BCC * 8 + 3)
#define                                 DMA2DPTR3_bit       _BIT_ACCESS(DMA2DPTRL,3)
// DMA2DPTRL<DMA2DPTR4>
extern volatile __bit                   DMA2DPTR4           __at(0x1DE64);	// @ (0x3BCC * 8 + 4)
