GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
#define                                 NACK1IE_bit         _BIT_ACCESS(I2C1ERR,0)
// I2C1ERR<NACK1IF>
extern volatile __bit                   NACK1IF             __at(0x1EBB4);	// @ (0x3D76 * 8 + 4)
#define                                 NACK1IF_bit         _BIT_ACCESS(I2C1ERR,4)
// I2C2ERR<NACK2IE>
extern volatile __bit                   NACK2IE             __at(0x1EB00);	// @ (0x3D60 * 8 + 0)
#define                                 NACK2IE_bit         _BIT_ACCESS(I2C2ERR,0)
// I2C2ERR<NACK2IF>
extern volatile __bit                   NACK2IF             __at(0x1EB04);	// @ (0x3D60 * 8 + 4)
#define                                 NACK2IF_bit         _BIT_ACCESS(I2C2ERR,4)
// NCO1ACCL<NCO1ACC0>
extern volatile __bit                   NCO1ACC0            __at(0x1F9C0);	// @ (0x3F38 * 8 + 0)
#define                                 NCO1ACC0_bit        _BIT_ACCESS(NCO1ACCL,0)
// NCO1ACCL<NCO1ACC1>
extern volatile __bit                   NCO1ACC1            __at(0x1F9C1);	// @ (0x3F38 * 8 + 1)
#define                                 NCO1ACC1_bit        _BIT_ACCESS(NCO1ACCL,1)
// NCO1ACCH<NCO1ACC10>
extern volatile __bit                   NCO1ACC10           __at(0x1F9CA);	// @ (0x3F39 * 8 + 2)
#define                                 NCO1ACC10_bit       _BIT_ACCESS(NCO1ACCH,2)
// NCO1ACCH<NCO1ACC11>
extern volatile __bit                   NCO1ACC11           __at(0x1F9CB);	// @ (0x3F39 * 8 + 3)
#define                                 NCO1ACC11_bit       _BIT_ACCESS(NCO1ACCH,3)
// NCO1ACCH<NCO1ACC12>
extern volatile __bit                   NCO1ACC12           __at(0x1F9CC);	// @ (0x3F39 * 8 + 4)
#define                                 NCO1ACC12_bit       _BIT_ACCESS(NCO1ACCH,4)
// NCO1ACCH<NCO1ACC13>
extern volatile __bit                   NCO1ACC13           __at(0x1F9CD);	// @ (0x3F39 * 8 + 5)
#define                                 NCO1ACC13_bit       _BIT_ACCESS(NCO1ACCH,5)
// NCO1ACCH<NCO1ACC14>
extern volatile __bit                   NCO1ACC14           __at(0x1F9CE);	// @ (0x3F39 * 8 + 6)
#define                                 NCO1ACC14_bit       _BIT_ACCESS(NCO1ACCH,6)
// NCO1ACCH<NCO1ACC15>
extern volatile __bit                   NCO1ACC15           __at(0x1F9CF);	// @ (0x3F39 * 8 + 7)
#define                                 NCO1ACC15_bit       _BIT_ACCESS(NCO1ACCH,7)
// NCO1ACCU<NCO1ACC16>
extern volatile __bit                   NCO1ACC16           __at(0x1F9D0);	// @ (0x3F3A * 8 + 0)
#define                                 NCO1ACC16_bit       _BIT_ACCESS(NCO1ACCU,0)
// NCO1ACCU<NCO1ACC17>
extern volatile __bit                   NCO1ACC17           __at(0x1F9D1);	// @ (0x3F3A * 8 + 1)
#define                                 NCO1ACC17_bit       _BIT_ACCESS(NCO1ACCU,1)
// NCO1ACCU<NCO1ACC18>
extern volatile __bit                   NCO1ACC18           __at(0x1F9D2);	// @ (0x3F3A * 8 + 2)
#define                                 NCO1ACC18_bit       _BIT_ACCESS(NCO1ACCU,2)
// NCO1ACCU<NCO1ACC19>
extern volatile __bit                   NCO1ACC19           __at(0x1F9D3);	// @ (0x3F3A * 8 + 3)
#define                                 NCO1ACC19_bit       _BIT_ACCESS(NCO1ACCU,3)
// NCO1ACCL<NCO1ACC2>
extern volatile __bit                   NCO1ACC2            __at(0x1F9C2);	// @ (0x3F38 * 8 + 2)
#define                                 NCO1ACC2_bit        _BIT_ACCESS(NCO1ACCL,2)
// NCO1ACCL<NCO1ACC3>
extern volatile __bit                   NCO1ACC3            __at(0x1F9C3);	// @ (0x3F38 * 8 + 3)
#define                                 NCO1ACC3_bit        _BIT_ACCESS(NCO1ACCL,3)
// NCO1ACCL<NCO1ACC4>
extern volatile __bit                   NCO1ACC4            __at(0x1F9C4);	// @ (0x3F38 * 8 + 4)
#define                                 NCO1ACC4_bit        _BIT_ACCESS(NCO1ACCL,4)
// NCO1ACCL<NCO1ACC5>
extern volatile __bit                   NCO1ACC5            __at(0x1F9C5);	// @ (0x3F38 * 8 + 5)
#define                                 NCO1ACC5_bit        _BIT_ACCESS(NCO1ACCL,5)
// NCO1ACCL<NCO1ACC6>
extern volatile __bit                   NCO1ACC6            __at(0x1F9C6);	// @ (0x3F38 * 8 + 6)
#define                                 NCO1ACC6_bit        _BIT_ACCESS(NCO1ACCL,6)
// NCO1ACCL<NCO1ACC7>
extern volatile __bit                   NCO1ACC7            __at(0x1F9C7);	// @ (0x3F38 * 8 + 7)
#define                                 NCO1ACC7_bit        _BIT_ACCESS(NCO1ACCL,7)
// NCO1ACCH<NCO1ACC8>
extern volatile __bit                   NCO1ACC8            __at(0x1F9C8);	// @ (0x3F39 * 8 + 0)
#define                                 NCO1ACC8_bit        _BIT_ACCESS(NCO1ACCH,0)
// NCO1ACCH<NCO1ACC9>
extern volatile __bit                   NCO1ACC9            __at(0x1F9C9);	// @ (0x3F39 * 8 + 1)
#define                                 NCO1ACC9_bit        _BIT_ACCESS(NCO1ACCH,1)
// NCO1CLK<NCO1CKS0>
extern volatile __bit                   NCO1CKS0            __at(0x1F9F8);	// @ (0x3F3F * 8 + 0)
#define                                 NCO1CKS0_bit        _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<NCO1CKS1>
extern volatile __bit                   NCO1CKS1            __at(0x1F9F9);	// @ (0x3F3F * 8 + 1)
#define                                 NCO1CKS1_bit        _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<NCO1CKS2>
extern volatile __bit                   NCO1CKS2            __at(0x1F9FA);	// @ (0x3F3F * 8 + 2)
#define                                 NCO1CKS2_bit        _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<NCO1CKS3>
extern volatile __bit                   NCO1CKS3            __at(0x1F9FB);	// @ (0x3F3F * 8 + 3)
#define                                 NCO1CKS3_bit        _BIT_ACCESS(NCO1CLK,3)
// NCO1CON<NCO1EN>
extern volatile __bit                   NCO1EN              __at(0x1F9F7);	// @ (0x3F3E * 8 + 7)
#define                                 NCO1EN_bit          _BIT_ACCESS(NCO1CON,7)
// PIE4<NCO1IE>
extern volatile __bit                   NCO1IE              __at(0x1CCA5);	// @ (0x3994 * 8 + 5)
#define                                 NCO1IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<NCO1IF>
extern volatile __bit                   NCO1IF              __at(0x1CD25);	// @ (0x39A4 * 8 + 5)
#define                                 NCO1IF_bit          _BIT_ACCESS(PIR4,5)
// NCO1INCL<NCO1INC0>
extern volatile __bit                   NCO1INC0            __at(0x1F9D8);	// @ (0x3F3B * 8 + 0)
#define                                 NCO1INC0_bit        _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<NCO1INC1>
extern volatile __bit                   NCO1INC1            __at(0x1F9D9);	// @ (0x3F3B * 8 + 1)
#define                                 NCO1INC1_bit        _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<NCO1INC10>
extern volatile __bit                   NCO1INC10           __at(0x1F9E2);	// @ (0x3F3C * 8 + 2)
#define                                 NCO1INC10_bit       _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<NCO1INC11>
extern volatile __bit                   NCO1INC11           __at(0x1F9E3);	// @ (0x3F3C * 8 + 3)
#define                                 NCO1INC11_bit       _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<NCO1INC12>
extern volatile __bit                   NCO1INC12           __at(0x1F9E4);	// @ (0x3F3C * 8 + 4)
#define                                 NCO1INC12_bit       _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<NCO1INC13>
extern volatile __bit                   NCO1INC13           __at(0x1F9E5);	// @ (0x3F3C * 8 + 5)
#define                                 NCO1INC13_bit       _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<NCO1INC14>
extern volatile __bit                   NCO1INC14           __at(0x1F9E6);	// @ (0x3F3C * 8 + 6)
#define                                 NCO1INC14_bit       _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<NCO1INC15>
extern volatile __bit                   NCO1INC15           __at(0x1F9E7);	// @ (0x3F3C * 8 + 7)
#define                                 NCO1INC15_bit       _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<NCO1INC16>
extern volatile __bit                   NCO1INC16           __at(0x1F9E8);	// @ (0x3F3D * 8 + 0)
#define                                 NCO1INC16_bit       _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<NCO1INC17>
extern volatile __bit                   NCO1INC17           __at(0x1F9E9);	// @ (0x3F3D * 8 + 1)
#define                                 NCO1INC17_bit       _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<NCO1INC18>
extern volatile __bit                   NCO1INC18           __at(0x1F9EA);	// @ (0x3F3D * 8 + 2)
#define                                 NCO1INC18_bit       _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<NCO1INC19>
extern volatile __bit                   NCO1INC19           __at(0x1F9EB);	// @ (0x3F3D * 8 + 3)
#define                                 NCO1INC19_bit       _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<NCO1INC2>
extern volatile __bit                   NCO1INC2            __at(0x1F9DA);	// @ (0x3F3B * 8 + 2)
#define                                 NCO1INC2_bit        _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<NCO1INC3>
extern volatile __bit                   NCO1INC3            __at(0x1F9DB);	// @ (0x3F3B * 8 + 3)
#define                                 NCO1INC3_bit        _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<NCO1INC4>
extern volatile __bit                   NCO1INC4            __at(0x1F9DC);	// @ (0x3F3B * 8 + 4)
#define                                 NCO1INC4_bit        _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<NCO1INC5>
extern volatile __bit                   NCO1INC5            __at(0x1F9DD);	// @ (0x3F3B * 8 + 5)
#define                                 NCO1INC5_bit        _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<NCO1INC6>
extern volatile __bit                   NCO1INC6            __at(0x1F9DE);	// @ (0x3F3B * 8 + 6)
#define                                 NCO1INC6_bit        _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<NCO1INC7>
extern volatile __bit                   NCO1INC7            __at(0x1F9DF);	// @ (0x3F3B * 8 + 7)
#define                                 NCO1INC7_bit        _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<NCO1INC8>
extern volatile __bit                   NCO1INC8            __at(0x1F9E0);	// @ (0x3F3C * 8 + 0)
#define                                 NCO1INC8_bit        _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<NCO1INC9>
extern volatile __bit                   NCO1INC9            __at(0x1F9E1);	// @ (0x3F3C * 8 + 1)
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// IPR4<NCO1IP>
extern volatile __bit                   NCO1IP              __at(0x1CC25);	// @ (0x3984 * 8 + 5)
#define                                 NCO1IP_bit          _BIT_ACCESS(IPR4,5)
// PMD1<NCO1MD>
extern volatile __bit                   NCO1MD              __at(0x1CE0F);	// @ (0x39C1 * 8 + 7)
#define                                 NCO1MD_bit          _BIT_ACCESS(PMD1,7)
// NCO1CON<NCO1OUT>
extern volatile __bit                   NCO1OUT             __at(0x1F9F5);	// @ (0x3F3E * 8 + 5)
#define                                 NCO1OUT_bit         _BIT_ACCESS(NCO1CON,5)
// NCO1CON<NCO1PFM>
extern volatile __bit                   NCO1PFM             __at(0x1F9F0);	// @ (0x3F3E * 8 + 0)
#define                                 NCO1PFM_bit         _BIT_ACCESS(NCO1CON,0)
// NCO1CON<NCO1POL>
extern volatile __bit                   NCO1POL             __at(0x1F9F4);	// @ (0x3F3E * 8 + 4)
#define                                 NCO1POL_bit         _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<NCO1PWS0>
extern volatile __bit                   NCO1PWS0            __at(0x1F9FD);	// @ (0x3F3F * 8 + 5)
#define                                 NCO1PWS0_bit        _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<NCO1PWS1>
extern volatile __bit                   NCO1PWS1            __at(0x1F9FE);	// @ (0x3F3F * 8 + 6)
#define                                 NCO1PWS1_bit        _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<NCO1PWS2>
extern volatile __bit                   NCO1PWS2            __at(0x1F9FF);	// @ (0x3F3F * 8 + 7)
#define                                 NCO1PWS2_bit        _BIT_ACCESS(NCO1CLK,7)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x1CEC8);	// @ (0x39D9 * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x1CEC9);	// @ (0x39D9 * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x1CECA);	// @ (0x39D9 * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x1CECB);	// @ (0x39D9 * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x1FEC4);	// @ (0x3FD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x1CECC);	// @ (0x39D9 * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x1CECD);	// @ (0x39D9 * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x1CECE);	// @ (0x39D9 * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x1CEDB);	// @ (0x39DB * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// PCON1<NOT_MEMV>
extern volatile __bit                   NOT_MEMV            __at(0x1FF89);	// @ (0x3FF1 * 8 + 1)
#define                                 NOT_MEMV_bit        _BIT_ACCESS(PCON1,1)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x1FD9B);	// @ (0x3FB3 * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x1FD92);	// @ (0x3FB2 * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x1FD3B);	// @ (0x3FA7 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x1FD32);	// @ (0x3FA6 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x1FCDB);	// @ (0x3F9B * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x1FCD2);	// @ (0x3F9A * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x1F7EC);	// @ (0x3EFD * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// DAC1CON0<NSS>
extern volatile __bit                   NSS                 __at(0x1F4F0);	// @ (0x3E9E * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC1CON0,0)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x1CF00);	// @ (0x39E0 * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x1CF01);	// @ (0x39E0 * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x1CF02);	// @ (0x39E0 * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x1CF03);	// @ (0x39E0 * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x1CF04);	// @ (0x39E0 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x1CF05);	// @ (0x39E0 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x1CF06);	// @ (0x39E0 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x1CF07);	// @ (0x39E0 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMDAT<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x1CF18);	// @ (0x39E3 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDAT,0)
// NVMDAT<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x1CF19);	// @ (0x39E3 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDAT,1)
// NVMDAT<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x1CF1A);	// @ (0x39E3 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDAT,2)
// NVMDAT<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x1CF1B);	// @ (0x39E3 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDAT,3)
// NVMDAT<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x1CF1C);	// @ (0x39E3 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDAT,4)
// NVMDAT<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x1CF1D);	// @ (0x39E3 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDAT,5)
// NVMDAT<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x1CF1E);	// @ (0x39E3 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDAT,6)
// NVMDAT<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x1CF1F);	// @ (0x39E3 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDAT,7)
// PIE0<NVMIE>
extern volatile __bit                   NVMIE               __at(0x1CC84);	// @ (0x3990 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<NVMIF>
extern volatile __bit                   NVMIF               __at(0x1CD04);	// @ (0x39A0 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<NVMIP>
extern volatile __bit                   NVMIP               __at(0x1CC04);	// @ (0x3980 * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR0,4)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x1CE02);	// @ (0x39C0 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREG0>
extern volatile __bit                   NVMREG0             __at(0x1CF2E);	// @ (0x39E5 * 8 + 6)
#define                                 NVMREG0_bit         _BIT_ACCESS(NVMCON1,6)
// NVMCON1<NVMREG1>
extern volatile __bit                   NVMREG1             __at(0x1CF2F);	// @ (0x39E5 * 8 + 7)
#define                                 NVMREG1_bit         _BIT_ACCESS(NVMCON1,7)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x1D210);	// @ (0x3A42 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x1D211);	// @ (0x3A42 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x1D212);	// @ (0x3A42 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x1D213);	// @ (0x3A42 * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x1D214);	// @ (0x3A42 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x1D215);	// @ (0x3A42 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x1D216);	// @ (0x3A42 * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x1D217);	// @ (0x3A42 * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x1D290);	// @ (0x3A52 * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x1D291);	// @ (0x3A52 * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x1D292);	// @ (0x3A52 * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x1D293);	// @ (0x3A52 * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x1D294);	// @ (0x3A52 * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x1D295);	// @ (0x3A52 * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x1D296);	// @ (0x3A52 * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x1D297);	// @ (0x3A52 * 8 + 7)
