GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.h
extern volatile __bit                   TMR3H5              __at(0x1FD2D);	// @ (0x3FA5 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1FD2E);	// @ (0x3FA5 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1FD2F);	// @ (0x3FA5 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE6<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x1CCB6);	// @ (0x3996 * 8 + 6)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE6,6)
// PIR6<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x1CD36);	// @ (0x39A6 * 8 + 6)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR6,6)
// IPR6<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x1CC36);	// @ (0x3986 * 8 + 6)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR6,6)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1FD20);	// @ (0x3FA4 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1FD21);	// @ (0x3FA4 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x1FD22);	// @ (0x3FA4 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x1FD23);	// @ (0x3FA4 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x1FD24);	// @ (0x3FA4 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x1FD25);	// @ (0x3FA4 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x1FD26);	// @ (0x3FA4 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x1FD27);	// @ (0x3FA4 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x1CE0B);	// @ (0x39C1 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1FD30);	// @ (0x3FA6 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE7<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x1CCB8);	// @ (0x3997 * 8 + 0)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE7,0)
// PIR7<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x1CD38);	// @ (0x39A7 * 8 + 0)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR7,0)
// IPR7<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x1CC38);	// @ (0x3987 * 8 + 0)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR7,0)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x1CE0C);	// @ (0x39C1 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1FD07);	// @ (0x3FA0 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// SMT1TMRL<TMR5>
extern volatile __bit                   TMR5                __at(0x1F895);	// @ (0x3F12 * 8 + 5)
#define                                 TMR5_bit            _BIT_ACCESS(SMT1TMRL,5)
// PIE8<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x1CCC7);	// @ (0x3998 * 8 + 7)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE8,7)
// PIR8<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0x1CD47);	// @ (0x39A8 * 8 + 7)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR8,7)
// IPR8<TMR5GIP>
extern volatile __bit                   TMR5GIP             __at(0x1CC47);	// @ (0x3988 * 8 + 7)
#define                                 TMR5GIP_bit         _BIT_ACCESS(IPR8,7)
// TMR5H<TMR5H0>
extern volatile __bit                   TMR5H0              __at(0x1FCC8);	// @ (0x3F99 * 8 + 0)
#define                                 TMR5H0_bit          _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR5H1>
extern volatile __bit                   TMR5H1              __at(0x1FCC9);	// @ (0x3F99 * 8 + 1)
#define                                 TMR5H1_bit          _BIT_ACCESS(TMR5H,1)
// TMR5H<TMR5H2>
extern volatile __bit                   TMR5H2              __at(0x1FCCA);	// @ (0x3F99 * 8 + 2)
#define                                 TMR5H2_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR5H3>
extern volatile __bit                   TMR5H3              __at(0x1FCCB);	// @ (0x3F99 * 8 + 3)
#define                                 TMR5H3_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR5H4>
extern volatile __bit                   TMR5H4              __at(0x1FCCC);	// @ (0x3F99 * 8 + 4)
#define                                 TMR5H4_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR5H5>
extern volatile __bit                   TMR5H5              __at(0x1FCCD);	// @ (0x3F99 * 8 + 5)
#define                                 TMR5H5_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR5H6>
extern volatile __bit                   TMR5H6              __at(0x1FCCE);	// @ (0x3F99 * 8 + 6)
#define                                 TMR5H6_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR5H7>
extern volatile __bit                   TMR5H7              __at(0x1FCCF);	// @ (0x3F99 * 8 + 7)
#define                                 TMR5H7_bit          _BIT_ACCESS(TMR5H,7)
// PIE8<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x1CCC6);	// @ (0x3998 * 8 + 6)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0x1CD46);	// @ (0x39A8 * 8 + 6)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR8,6)
// IPR8<TMR5IP>
extern volatile __bit                   TMR5IP              __at(0x1CC46);	// @ (0x3988 * 8 + 6)
#define                                 TMR5IP_bit          _BIT_ACCESS(IPR8,6)
// TMR5L<TMR5L0>
extern volatile __bit                   TMR5L0              __at(0x1FCC0);	// @ (0x3F98 * 8 + 0)
#define                                 TMR5L0_bit          _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR5L1>
extern volatile __bit                   TMR5L1              __at(0x1FCC1);	// @ (0x3F98 * 8 + 1)
#define                                 TMR5L1_bit          _BIT_ACCESS(TMR5L,1)
// TMR5L<TMR5L2>
extern volatile __bit                   TMR5L2              __at(0x1FCC2);	// @ (0x3F98 * 8 + 2)
#define                                 TMR5L2_bit          _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR5L3>
extern volatile __bit                   TMR5L3              __at(0x1FCC3);	// @ (0x3F98 * 8 + 3)
#define                                 TMR5L3_bit          _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR5L4>
extern volatile __bit                   TMR5L4              __at(0x1FCC4);	// @ (0x3F98 * 8 + 4)
#define                                 TMR5L4_bit          _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR5L5>
extern volatile __bit                   TMR5L5              __at(0x1FCC5);	// @ (0x3F98 * 8 + 5)
#define                                 TMR5L5_bit          _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR5L6>
extern volatile __bit                   TMR5L6              __at(0x1FCC6);	// @ (0x3F98 * 8 + 6)
#define                                 TMR5L6_bit          _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR5L7>
extern volatile __bit                   TMR5L7              __at(0x1FCC7);	// @ (0x3F98 * 8 + 7)
#define                                 TMR5L7_bit          _BIT_ACCESS(TMR5L,7)
// PMD1<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x1CE0D);	// @ (0x39C1 * 8 + 5)
#define                                 TMR5MD_bit          _BIT_ACCESS(PMD1,5)
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x1FCD0);	// @ (0x3F9A * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE9<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x1CCC8);	// @ (0x3999 * 8 + 0)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE9,0)
// PIR9<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x1CD48);	// @ (0x39A9 * 8 + 0)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR9,0)
// IPR9<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x1CC48);	// @ (0x3989 * 8 + 0)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR9,0)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x1CE0E);	// @ (0x39C1 * 8 + 6)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,6)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x1FCA7);	// @ (0x3F94 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// SMT1TMRL<TMR7>
extern volatile __bit                   TMR7                __at(0x1F897);	// @ (0x3F12 * 8 + 7)
#define                                 TMR7_bit            _BIT_ACCESS(SMT1TMRL,7)
// SMT1TMRH<TMR8>
extern volatile __bit                   TMR8                __at(0x1F898);	// @ (0x3F13 * 8 + 0)
#define                                 TMR8_bit            _BIT_ACCESS(SMT1TMRH,0)
// SMT1TMRH<TMR9>
extern volatile __bit                   TMR9                __at(0x1F899);	// @ (0x3F13 * 8 + 1)
#define                                 TMR9_bit            _BIT_ACCESS(SMT1TMRH,1)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1CBE6);	// @ (0x397C * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x1FE10);	// @ (0x3FC2 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x1FE11);	// @ (0x3FC2 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x1FE12);	// @ (0x3FC2 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x1FE13);	// @ (0x3FC2 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x1FE14);	// @ (0x3FC2 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x1FE15);	// @ (0x3FC2 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x1FE16);	// @ (0x3FC2 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x1FE17);	// @ (0x3FC2 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x1FE18);	// @ (0x3FC3 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x1FE19);	// @ (0x3FC3 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x1FE1A);	// @ (0x3FC3 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x1FE1B);	// @ (0x3FC3 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x1FE1C);	// @ (0x3FC3 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x1FE1D);	// @ (0x3FC3 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x1FE1E);	// @ (0x3FC3 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x1FE1F);	// @ (0x3FC3 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x1FE20);	// @ (0x3FC4 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x1FE21);	// @ (0x3FC4 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x1FE22);	// @ (0x3FC4 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x1FE23);	// @ (0x3FC4 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x1FE24);	// @ (0x3FC4 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x1FE25);	// @ (0x3FC4 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x1FE26);	// @ (0x3FC4 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x1FE27);	// @ (0x3FC4 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x1F902);	// @ (0x3F20 * 8 + 2)
#define                                 TS_bit              _BIT_ACCESS(SMT1STAT,2)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1F60D);	// @ (0x3EC1 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1F60C);	// @ (0x3EC1 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x1CEF0);	// @ (0x39DE * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x1CEF1);	// @ (0x39DE * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x1CEF2);	// @ (0x39DE * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x1CEF3);	// @ (0x39DE * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x1CEF4);	// @ (0x39DE * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x1CEF5);	// @ (0x39DE * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// SPI1TWIDTH<TWIDTH0>
extern volatile __bit                   TWIDTH0             __at(0x1E8C0);	// @ (0x3D18 * 8 + 0)
#define                                 TWIDTH0_bit         _BIT_ACCESS(SPI1TWIDTH,0)
// SPI1TWIDTH<TWIDTH1>
extern volatile __bit                   TWIDTH1             __at(0x1E8C1);	// @ (0x3D18 * 8 + 1)
#define                                 TWIDTH1_bit         _BIT_ACCESS(SPI1TWIDTH,1)
// SPI1TWIDTH<TWIDTH2>
extern volatile __bit                   TWIDTH2             __at(0x1E8C2);	// @ (0x3D18 * 8 + 2)
#define                                 TWIDTH2_bit         _BIT_ACCESS(SPI1TWIDTH,2)
// SPI1TXB<TXB0>
extern volatile __bit                   TXB0                __at(0x1E888);	// @ (0x3D11 * 8 + 0)
#define                                 TXB0_bit            _BIT_ACCESS(SPI1TXB,0)
// SPI1TXB<TXB1>
extern volatile __bit                   TXB1                __at(0x1E889);	// @ (0x3D11 * 8 + 1)
#define                                 TXB1_bit            _BIT_ACCESS(SPI1TXB,1)
// SPI1TXB<TXB2>
extern volatile __bit                   TXB2                __at(0x1E88A);	// @ (0x3D11 * 8 + 2)
#define                                 TXB2_bit            _BIT_ACCESS(SPI1TXB,2)
// SPI1TXB<TXB3>
extern volatile __bit                   TXB3                __at(0x1E88B);	// @ (0x3D11 * 8 + 3)
#define                                 TXB3_bit            _BIT_ACCESS(SPI1TXB,3)
// SPI1TXB<TXB4>
extern volatile __bit                   TXB4                __at(0x1E88C);	// @ (0x3D11 * 8 + 4)
#define                                 TXB4_bit            _BIT_ACCESS(SPI1TXB,4)
// SPI1TXB<TXB5>
extern volatile __bit                   TXB5                __at(0x1E88D);	// @ (0x3D11 * 8 + 5)
#define                                 TXB5_bit            _BIT_ACCESS(SPI1TXB,5)
// SPI1TXB<TXB6>
extern volatile __bit                   TXB6                __at(0x1E88E);	// @ (0x3D11 * 8 + 6)
#define                                 TXB6_bit            _BIT_ACCESS(SPI1TXB,6)
// SPI1TXB<TXB7>
extern volatile __bit                   TXB7                __at(0x1E88F);	// @ (0x3D11 * 8 + 7)
#define                                 TXB7_bit            _BIT_ACCESS(SPI1TXB,7)
// SPI1CON2<TXR>
extern volatile __bit                   TXR                 __at(0x1E8B1);	// @ (0x3D16 * 8 + 1)
#define                                 TXR_bit             _BIT_ACCESS(SPI1CON2,1)
// SPI1INTE<TXUIE>
extern volatile __bit                   TXUIE               __at(0x1E8D9);	// @ (0x3D1B * 8 + 1)
#define                                 TXUIE_bit           _BIT_ACCESS(SPI1INTE,1)
// SPI1INTF<TXUIF>
extern volatile __bit                   TXUIF               __at(0x1E8D1);	// @ (0x3D1A * 8 + 1)
#define                                 TXUIF_bit           _BIT_ACCESS(SPI1INTF,1)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x1EF96);	// @ (0x3DF2 * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x1EFC2);	// @ (0x3DF8 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0x1EFC6);	// @ (0x3DF8 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x1EFD5);	// @ (0x3DFA * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x1EFCD);	// @ (0x3DF9 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x1EF97);	// @ (0x3DF2 * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1EF99);	// @ (0x3DF3 * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x1EFA3);	// @ (0x3DF4 * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x1EFD4);	// @ (0x3DFA * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x1EFCC);	// @ (0x3DF9 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// PIE3<U1EIE>
extern volatile __bit                   U1EIE               __at(0x1CC9D);	// @ (0x3993 * 8 + 5)
#define                                 U1EIE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<U1EIF>
extern volatile __bit                   U1EIF               __at(0x1CD1D);	// @ (0x39A3 * 8 + 5)
#define                                 U1EIF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<U1EIP>
extern volatile __bit                   U1EIP               __at(0x1CC1D);	// @ (0x3983 * 8 + 5)
#define                                 U1EIP_bit           _BIT_ACCESS(IPR3,5)
// U1ERRIE<U1FERIE>
extern volatile __bit                   U1FERIE             __at(0x1EFD3);	// @ (0x3DFA * 8 + 3)
#define                                 U1FERIE_bit         _BIT_ACCESS(U1ERRIE,3)
// U1ERRIR<U1FERIF>
extern volatile __bit                   U1FERIF             __at(0x1EFCB);	// @ (0x3DF9 * 8 + 3)
#define                                 U1FERIF_bit         _BIT_ACCESS(U1ERRIR,3)
// U1CON2<U1FLO0>
extern volatile __bit                   U1FLO0              __at(0x1EFA0);	// @ (0x3DF4 * 8 + 0)
#define                                 U1FLO0_bit          _BIT_ACCESS(U1CON2,0)
// U1CON2<U1FLO1>
extern volatile __bit                   U1FLO1              __at(0x1EFA1);	// @ (0x3DF4 * 8 + 1)
#define                                 U1FLO1_bit          _BIT_ACCESS(U1CON2,1)
// PIE3<U1IE>
extern volatile __bit                   U1IE                __at(0x1CC9E);	// @ (0x3993 * 8 + 6)
#define                                 U1IE_bit            _BIT_ACCESS(PIE3,6)
// PIR3<U1IF>
extern volatile __bit                   U1IF                __at(0x1CD1E);	// @ (0x39A3 * 8 + 6)
#define                                 U1IF_bit            _BIT_ACCESS(PIR3,6)
// IPR3<U1IP>
extern volatile __bit                   U1IP                __at(0x1CC1E);	// @ (0x3983 * 8 + 6)
#define                                 U1IP_bit            _BIT_ACCESS(IPR3,6)
// PMD5<U1MD>
extern volatile __bit                   U1MD                __at(0x1CE2C);	// @ (0x39C5 * 8 + 4)
